[
    {
        "source": "CoinTelegraph",
        "title": "UK to deliver comprehensive crypto regulation framework by early 2025",
        "link": "https://cointelegraph.com/news/uk-crypto-regulation-framework-2025?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
        "published": "2024-11-21T20:26:20Z",
        "summary": "<p style=\"float: right; margin: 0 0 10px 15px; width: 240px;\"><img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMTEvMDE5MzUwNWUtMmUwYi03OGI2LWExMjYtM2EzZGE0Zjg4MjJk.jpg\" /></p><p>The Labour government is reportedly readying crypto asset regulations as Europe pulls ahead and the US elects a pro-crypto president.</p>",
        "content": "",
        "categories": [
            "UK crypto regulation",
            "Labour government",
            "stablecoins",
            "staking services",
            "cryptocurrency framework",
            "crypto assets",
            "UK Treasury",
            "tokenisation summit"
        ]
    },
    {
        "source": "CoinDesk",
        "title": "Crypto Exchange Archax to Offer Tokenized Money Market Funds from State Street, Fidelity International and LGIM",
        "link": "https://www.coindesk.com/business/2024/11/20/crypto-exchange-archax-to-offer-tokenized-money-market-funds-from-state-street-fidelity-and-lgim/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
        "published": "2024-11-20T08:00:00Z",
        "summary": "The tokenized assets will initially be made available on Hedera Hashgraph, XRPL and Arbitrum.",
        "content": "Archax is to offer tokenized money market funds from State Street, Fidelity and LGIM. (engin akyurt/Unsplash)",
        "categories": [
            "Finance",
            "news",
            "Archax",
            "Exclusive",
            "Tokenization",
            "Fidelity International"
        ]
    },
    {
        "source": "BlockWorks",
        "title": "Solana is excited about new stablecoin infrastructure provider Perena",
        "link": "https://blockworks.co/news/solana-stablecoin-infra-provider",
        "published": "2024-11-19T19:00:00.000Z",
        "summary": "Perena is built on the premise that as stablecoins proliferate, liquidity could fragment, and stablecoins aren’t useful if they aren’t liquid",
        "content": "<p><br /><em>This is a segment from yesterday’s Lightspeed newsletter. To read full editions, </em><a href=\"https://blockworks.co/newsletter/lightspeed\"><em>subscribe</em></a><em>.</em></p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p>When I talk to Solana ecosystem people, I’ll sometimes ask what new projects they’ve been hearing about. One such project that’s been catching apparent buzz is Perena, a stablecoin infrastructure protocol.</p>\n\n\n\n<p>Perena is built on the premise that as stablecoins proliferate, liquidity could fragment, and stablecoins aren’t useful if they aren’t liquid. The platform offers a Solana-based stablecoin liquidity pool, and it plans to offer an <a href=\"https://x.com/SamBroner/status/1857072872205730283\">asset-backed</a> stablecoin in the future.</p>\n\n\n\n<p>The project was founded by Anna Yuan, who started the Solana Foundation’s stablecoin arm during her more than two years at the non-profit. While working at the foundation, Yuan began to see that new stablecoin issuers would mint a lot of tokens but would have limited integrations, and users consequently weren’t able to benefit from stablecoins in the real world.&nbsp;</p>\n\n\n\n<p>She cited Ondo as an example — the tokenized US Treasury stablecoin has over $100 million in supply but only 3,500 holders, <a href=\"https://solscan.io/token/A1KLoBrKBde8Ty9qtNQUtq3C2ortoC3u7twggz7sEto6\">according</a> to SolScan.</p>\n\n\n\n<p>I asked Yuan about the commonly cited claim in crypto that stablecoins have pulled off the difficult task of finding product-market fit, or satisfying the needs of an existing market.</p>\n\n\n\n<p>“I don’t agree,” Yuan said, adding that liquidity begets PMF, and most stablecoins simply aren’t liquid enough to be useful. She added that the real-world need for things like money transfers in emerging markets will help stablecoins “get there.”</p>\n\n\n\n<p>Perena is currently in closed beta, but the platform’s main feature will initially be a multi-stablecoin liquidity pool which uses a liquidity provider token called USD* that represents a piece of a seed pool containing Tether, Circle, and PayPal USD. In simpler terms, the liquidity pool model should make it easier to issue stablecoins, since smaller coins can access the liquidity from the well-capitalized seed pool.</p>\n\n\n\n<p>The concept has raised to-be-announced seed funds, and Yuan’s deep links in Solana helped her tap into the ecosystem’s very-active angel investor community. Yuan said she decided to start raising funds on a Thursday, and by late Friday, she already had a couple dozen angel investors on board. Solana co-founders Anatoly Yakovenko and Raj Gokal are both noteworthy backers.&nbsp;</p>\n\n\n\n<p>At the end of our call, Yuan and I got chatting about how Solana’s stablecoin market capitalization can meaningfully grow. The network currently accounts for just 2% of all stables, according to DeFiLlama.</p>\n\n\n\n<p>Yuan gave an interesting answer: Solana PayFi could grow the economy for people taking their paycheck in stablecoins. She estimated 2,000 people currently take their full-time salary in Solana stablecoins. That number could certainly get a lot bigger.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p><strong>Start your day with top crypto insights from David Canellis and Katherine Ross. <a href=\"https://blockworks.co/newsletter/empire\">Subscribe to the Empire newsletter</a>.</strong></p>\n\n\n\n<p><strong>Explore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. <a href=\"https://blockworks.co/newsletter/onthemargin\">Subscribe to the Forward Guidance newsletter</a>.</strong></p>\n\n\n\n<p><strong>Get alpha directly in your inbox with the <a href=\"https://blockworks.co/newsletter/research\">0xResearch newsletter</a> — market highlights, charts, degen trade ideas, governance updates, and more.</strong></p>\n\n\n\n<p><strong>The Lightspeed newsletter is all things Solana, in your inbox, every day. <a href=\"https://blockworks.co/newsletter/lightspeed\">Subscribe to daily Solana news</a> from Jack Kubinec and Jeff Albus.</strong></p>",
        "categories": [
            "DeFi",
            "Lightspeed Newsletter"
        ]
    },
    {
        "source": "BlockWorks",
        "title": "Franklin Templeton launches Benji on Ethereum in ‘milestone’ move",
        "link": "https://blockworks.co/news/franklin-templeton-launches-benji-on-ethereum",
        "published": "2024-11-14T14:01:00.000Z",
        "summary": "Franklin’s Sandy Kaul told Blockworks that the firm is working on “new and innovative” blockchain solutions for clients",
        "content": "<p><em>This is a segment from the Empire newsletter. To read full editions,&nbsp;</em><a href=\"https://blockworks.co/newsletter/empire\" rel=\"noreferrer noopener\"><em>subscribe</em></a><em>.</em></p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p>Franklin Templeton is launching its Benji tokenization platform on the Ethereum network, marking its fifth launch this year after Aptos, Avalanche, Arbitrum and Base. It was previously only available on Stellar and Polygon.</p>\n\n\n\n<p>“The launch of our Benji platform on the Ethereum network represents an important milestone in our ongoing efforts to develop new and innovative blockchain solutions for our clients,” Franklin Templeton’s Sandy Kaul exclusively told us.&nbsp;</p>\n\n\n\n<p>“We look forward to further exploring ways in which we can utilize the network’s Ethereum Virtual Machine and smart contract functionality to unlock new capabilities for our tokenized funds.”</p>\n\n\n\n<p>According to rwa.xyz data, tokenized treasuries have jumped nearly 2% in the last seven days, boosting their total market cap to over $2.37 billion. Franklin’s onchain market fund sits at $409 million.&nbsp;</p>\n\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" class=\"wp-image-94432\" height=\"678\" src=\"https://blockworks-co.imgix.net/wp-content/uploads/2024/11/image-9.png\" width=\"1246\" /><figcaption class=\"wp-element-caption\"><em>Source: rwa.xyz</em></figcaption></figure>\n\n\n\n<p>Franklin’s is the third largest fund after BlackRock’s BUIDL and Ondo’s USDY.&nbsp;</p>\n\n\n\n<p>And perhaps there’s something in the water, because BUIDL is also expanding to different chains, now available on Aptos, Optimism’s OP Mainnet, Polygon, Arbitrum and Avalanche.&nbsp;</p>\n\n\n\n<p>I asked Securitize CEO Carlos Domingo if the expansion is a sign of maturity, given that BUIDL is one of the newest funds in the space. Franklin’s, for example, has been around since 2021 and was the first registered money market fund to use blockchain technology to record transactions.&nbsp;</p>\n\n\n\n<p>BlackRock’s bullish stride into crypto otherwise really started this year, with the launch of the bitcoin ETFs in January and then BUIDL shortly after.&nbsp;</p>\n\n\n\n<p>Domingo said that this is “just the beginning” for the fund and that it plans to roll out more features. He told me that this is also the first time that Securitize has issued the same asset on multiple chains versus picking one chain and issuing the asset there.&nbsp;</p>\n\n\n\n<p>“So for us, there’s been a major change in the way we run our infrastructure on top of the different blockchains, so it’s encouraging,” he said.</p>\n\n\n\n<p>No question about it, the tokenized fund space is heating up.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p><strong>Start your day with top crypto insights from David Canellis and Katherine Ross. <a href=\"https://blockworks.co/newsletter/empire\">Subscribe to the Empire newsletter</a>.</strong></p>\n\n\n\n<p><strong>Explore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. <a href=\"https://blockworks.co/newsletter/onthemargin\">Subscribe to the Forward Guidance newsletter</a>.</strong></p>\n\n\n\n<p><strong>Get alpha directly in your inbox with the <a href=\"https://blockworks.co/newsletter/research\">0xResearch newsletter</a> — market highlights, charts, degen trade ideas, governance updates, and more.</strong></p>\n\n\n\n<p><strong>The Lightspeed newsletter is all things Solana, in your inbox, every day. <a href=\"https://blockworks.co/newsletter/lightspeed\">Subscribe to daily Solana news</a> from Jack Kubinec and Jeff Albus.</strong></p>",
        "categories": [
            "Empire Newsletter",
            "Finance"
        ]
    },
    {
        "source": "Decrypt",
        "title": "BTC new ATH, SOL fee record, CHILLGUY hits $250M",
        "link": "https://decrypt.co/videos/interviews/93f92EPP/btc-new-ath-sol-fee-record-chillguy-hits-250m",
        "published": "2024-11-20T16:18:15Z",
        "summary": "BTC hits new ATH of $93.5k. Blackrock BTC ETF options see $1.9bn volume. Grayscale to launch BTC ETF options. SOL fees hit one day record amid memecoin frenzy. Phantom flips Chrome on app store. Saylor to pitch BTC strategy to Microsoft board. Rumble stock rises as CEO teases BTC adoption. Robinhood is best deregulation trade: Bernstein. Trump considers crypto lawyer to lead SEC. Pro-crypto Lutnick to lead commerce dept. Sky deploys stablecoin USDS on Solana. Archax to offer tokenized money market funds. Bitfinex offers tokenized T-bills in El Salvador. Coinbase to delist WBTC. MiCA compliance ignites EUR crypto M&amp;A surge. South Korea to launch 20% crypto tax. Chainlink joins Brazil CBDC trade pilot. Injective launches AI agent platform.",
        "content": "",
        "categories": []
    },
    {
        "source": "Decrypt",
        "title": "BTC pulls back to $87K, Hawkish Powell, MOODENG hits $650M",
        "link": "https://decrypt.co/videos/interviews/3omKCxQz/btc-pulls-back-to-87k-hawkish-powell-moodeng-hits-650m",
        "published": "2024-11-15T17:10:50Z",
        "summary": "BTC briefly hits $87k amid ETF outflows. BTC ETFs get third highest outflow since launch. BTC miners moved $4bn BTC since Nov 12. Tump wants 0% capital gains tax on crypto. Lummis proposes selling gold to buy BTC. Pennsylvania introduces BTC reserve bill. Bhutan sold $100m BTC in last month. 18 US states and DeFi Lobby sue SEC over crypto. Gensler defends crypto stance amid exit rumours. XRP at 16 month high on Gensler exit rumours. Tether launches platform to simplify tokenization. Satoshi’s BTC holdings $100bn. Bitwise files to list crypto index ETP. Bitfinex hacker sentenced to 5 years in prison. Sling Money opens ‘global venmo’ to US users. Web4 will involve ‘crypto & AGI’. S. Korea to fine Upbit for KYC violations.",
        "content": "",
        "categories": []
    },
    {
        "source": "Decrypt",
        "title": "Trump Wins Election, Bitcoin hits New ATH, memes & DeFi go Parabolic!",
        "link": "https://decrypt.co/videos/interviews/f7JEkoR5/trump-wins-election-bitcoin-hits-new-ath-memes-defi-go-parabolic",
        "published": "2024-11-09T19:20:29Z",
        "summary": "BTC hits ATH of $75k on Trump victory. Every coin in the top 100 higher. 220 pro-crypto candidates elected in US. Warren still defeats crypto advocate Deaton. Gensler out, Ulbritch freed and new policy expected. DeFi tokens the biggest gainers on Trump victory. BTC & SOL hit cycle highs against ETH. SOL flips BNB for 4th largest crypto. DOGE flips XRP for 7th largest crypto. VC funding hits $860m in Oct, up 30% MoM. Swift, UBS, Chainlink tokenisation pilot a success. AI agents will give retail traders ‘an edge’. Arkham supports TON.",
        "content": "",
        "categories": []
    },
    {
        "source": "Decrypt",
        "title": "BTC & Stocks ATH, FED decision today, PNUT hits $125M",
        "link": "https://decrypt.co/videos/interviews/TOKVHvmT/btc-stocks-ath-fed-decision-today-pnut-hits-125m",
        "published": "2024-11-09T19:20:29Z",
        "summary": "ETH leads majors, ETH/BTC reverses 8%. Blackrock BTC ETF hits record $4.1bn volume. BTC was up 1900% in Trump’s first term. Regulation headwind now tailwind: Bernstein. Bitcoin may hit $100k by year-end: BitGet. Trump may pass Bitcoin Act: CoinShares. Uyeda may replace Gensler at SEC. Lummis backs BTC as National Reserve asset. Tether bridges $2bn to ETH network. ETH ICO investor transfers $39.4mm to Kraken. DeFi coins outperform, ENA proposes fee swap. JPM allows instant FX settlement on blockchain. BNB allows tokenisation platform. CryptoCom plans stablecoin in 2025. Arkham launches perp futures exchange. AVAX buys $52m tokens from Luna Foundation. DOGE flip over XRP only brief. WLFI fails to see bounce in funding after election.",
        "content": "",
        "categories": []
    },
    {
        "source": "Decrypt",
        "title": "US Election Day, Large ETF outflows, FWOG hits $380M!",
        "link": "https://decrypt.co/videos/interviews/BQqxU2d6/us-election-day-large-etf-outflows-fwog-hits-380m",
        "published": "2024-11-05T21:12:57Z",
        "summary": "BTC ETF see largest outflows since May. BTC briefly dips below 68k, OI falls $2bn. BTC hashrate hits another ATH. MT Gox transfers $2.2bn BTC to 2 wallets. Crypto prediction markets favour Trump 63%. Major crypto firms launch stablecoin network. Semler Scientific bought $71m BTC in Q3. First UK pension fund buys $65m BTC ETF. Michigan Pension Fund buy ETH ETFs. ETH is Amazon 2.0: 21 Shares. Deutsche Telekom pilots BTC mining scheme. Tether denies plan for blockchain. Citi, Fidelity unveil tokenized FX swaps. Bitget introduces Bitget Pay. a16z send another $23m to crypto PAC. Binance & CZ attempt to squash SEC suit.",
        "content": "",
        "categories": []
    },
    {
        "source": "TechCrunch",
        "title": "New UK crypto regulations will include stablecoins and staking services",
        "link": "https://techcrunch.com/2024/11/22/new-uk-crypto-regulations-will-include-stablecoins-and-staking-services/",
        "published": "2024-11-22T10:36:38Z",
        "summary": "<p>The U.K. is set to create an all-encompassing regulatory framework to govern the crypto sector in early 2025. Speaking on Thursday at the Tokenisation Summit in London, economic secretary to the treasury Tulip Siddiq confirmed that the new rules would include cryptocurrency and stablecoins, which are pegged against a more stable asset such as a [&#8230;]</p>\n<p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>",
        "content": "",
        "categories": [
            "Fintech",
            "Government & Policy",
            "crypto regulation",
            "cryptocurrency",
            "stablecoin"
        ]
    }
]