[
    {
        "source": "Bybit",
        "title": "Ondo Launches Institutional-Grade Bridging for Tokenized RWAs with LayerZero Security",
        "link": "https://learn.bybit.com/daily-bits/ondo-launches-institutional-grade-bridging-for-tokenized-rwas/",
        "published": "12h ago",
        "content": "Ondo Finance has launched a new institutional-grade bridging solution for <b>tokenized</b> real-world assets (RWAs), leveraging LayerZero&#39;s decentralized&nbsp;...",
        "summary": null,
        "ranking_score": 70
    },
    {
        "source": "Cointelegraph",
        "title": "Ripple, Archax debut first tokenized money market fund on XRP Ledger",
        "link": "https://cointelegraph.com/news/ripple-launched-first-tokenized-money-market-fund-on-xrp-ledger",
        "published": "16h ago",
        "content": "Ripple has <b>tokenized</b> asset manager abrdn&#39;s $4.77 billion US dollar Liquidity Fund on XRP Ledger, the first money market fund of its kind on its&nbsp;...",
        "summary": null,
        "ranking_score": 70
    },
    {
        "source": "Coindesk",
        "title": "Tether to Shutter Euro Stablecoin as Key MiCA Deadline Looms",
        "link": "https://www.coindesk.com/business/2024/11/27/tether-to-shutter-euro-stablecoin-as-key-mi-ca-deadline-looms",
        "published": "7h ago",
        "content": "Instead, the company will focus on backing new stablecoin ventures such as its recent investment in Quantoz and its <b>tokenization</b> platform Hadron.",
        "summary": null,
        "ranking_score": 65
    },
    {
        "source": "Crowdfundinsider",
        "title": "RWAs: OpenTrade Raises $4 Million In Seed Funding To Build Asset Backed Lending ...",
        "link": "https://www.crowdfundinsider.com/2024/11/233478-rwas-opentrade-raises-4-million-in-seed-funding-to-build-asset-backed-lending-stablecoin-products/",
        "published": "7h ago",
        "content": "OpenTrade has closed on a $4 million &quot;Seed extension round&quot; as it seeks to build out <b>real</b>-<b>world asset</b>-backed lending and stablecoin yield&nbsp;...",
        "summary": null,
        "ranking_score": 50
    },
    {
        "source": "Binance",
        "title": "Dogecoin Whales Quietly Accumulate a Rival RWA Altcoin Set to Match DOGE's 2021 Gains ...",
        "link": "https://www.binance.com/en/square/post/16778744356929",
        "published": "18h ago",
        "content": "Below are lessons from Dogecoin&#39;s exponential growth, including how to make informed decisions about investing in this DOGE rival <b>RWA</b> altcoin. The&nbsp;...",
        "summary": null,
        "ranking_score": 50
    },
    {
        "source": "Bitcoinist",
        "title": "Kima successfully executes the first CBDC purchase of tokenized stocks on a stock exchange",
        "link": "https://bitcoinist.com/kima-successfully-executes-the-first-cbdc-purchase-of-tokenized-stocks-on-a-stock-exchange/",
        "published": "2h ago",
        "content": "Kima completes the first CBDC transaction of a <b>tokenized</b> stock during the Bank of Israel event at the Tel Aviv Stock Exchange.",
        "summary": null,
        "ranking_score": 50
    },
    {
        "source": "Livebitcoinnews",
        "title": "Zodia Custody and Securitize Partner to Advance Tokenized Finance",
        "link": "https://www.livebitcoinnews.com/zodia-custody-and-securitize-partner-to-advance-tokenized-finance/",
        "published": "7h ago",
        "content": "... potential of <b>tokenization</b>. <b>Tokenized</b> Assets Lead Financial Innovation with $530M BUIDL Fund. The current trends in the market serve this vision&nbsp;...",
        "summary": null,
        "ranking_score": 50
    },
    {
        "source": "Blockhead",
        "title": "Zodia, Securitize Team Up to Advance Tokenized Asset Adoption",
        "link": "https://www.blockhead.co/2024/11/27/zodia-securitize-team-up-to-advance-tokenized-asset-adoption/",
        "published": "15h ago",
        "content": "The move highlights the increasing institutional interest in <b>tokenized</b> assets, a burgeoning market that promises to redefine finance through&nbsp;...",
        "summary": null,
        "ranking_score": 50
    },
    {
        "source": "Financefeeds",
        "title": "Zodia Taps Securitize To Expand Institutional Access To Tokenized Assets",
        "link": "https://financefeeds.com/zodia-taps-securitize-to-expand-institutional-access-to-tokenized-assets/",
        "published": "15h ago",
        "content": "“BUIDL&#39;s sharp rise and adoption easily shows the opportunities that <b>tokenized</b> assets can offer,” said Julian Sawyer, CEO of Zodia Custody. “More&nbsp;...",
        "summary": null,
        "ranking_score": 50
    },
    {
        "source": "Ledgerinsights",
        "title": "StanChart's Zodia inks custody deal with Securitize, BlackRock's tokenization partner",
        "link": "https://www.ledgerinsights.com/stancharts-zodia-inks-custody-deal-with-securitize-blackrocks-tokenization-partner/",
        "published": "17h ago",
        "content": "Zodia Custody has partnered with Securitize to provide bank grade digital asset custody for <b>tokenized</b> assets like BlackRock&#39;s BUIDL.",
        "summary": null,
        "ranking_score": 50
    },
    {
        "source": "Crypto",
        "title": "Zodia Custody teams up with Securitize for institutional access to tokenized assets",
        "link": "https://crypto.news/zodia-custody-teams-up-with-securitize-for-institutional-access-to-tokenized-assets/",
        "published": "19h ago",
        "content": "<b>Tokenization</b> involves converting physical assets like real estate, stocks, or funds into digital tokens stored on a blockchain. These tokens represent&nbsp;...",
        "summary": null,
        "ranking_score": 50
    },
    {
        "source": "Morungexpress",
        "title": "RWA organises 1st Open Ngada Mini Hornbill Naga Wrestling C'ship",
        "link": "https://morungexpress.com/rwa-organises-1st-open-ngada-mini-hornbill-naga-wrestling-cship",
        "published": "5h ago",
        "content": "Our Correspondent Kohima | November 27. The Rengma Wrestling Association (<b>RWA</b>) with the support of Rengma Sports&#39; Association today conducted 1st&nbsp;...",
        "summary": null,
        "ranking_score": 40
    },
    {
        "source": "Jdsupra",
        "title": "UK embraces DLT and tokenisation: direction of travel",
        "link": "https://www.jdsupra.com/legalnews/uk-embraces-dlt-and-tokenisation-6322497/",
        "published": "5h ago",
        "content": "Future regime for cryptoassets in the UK. During her keynote speech at the <b>Tokenisation</b> Summit 2024 on 21 November 2024, Tulip Siddiq MP (Economic&nbsp;...",
        "summary": null,
        "ranking_score": 40
    },
    {
        "source": "Panewslab",
        "title": "An article explaining OpenEden in detail: Binance invests in RWA, a new option for U.S. ...",
        "link": "https://www.panewslab.com/en/articledetails/9i78coow61z0.html",
        "published": "5h ago",
        "content": "As a RWA (real world asset) <b>tokenization</b> protocol, OpenEden mainly focuses on the field of U.S. Treasury bond on-chain, and its operating mechanism is&nbsp;...",
        "summary": null,
        "ranking_score": 40
    },
    {
        "source": "Newsbtc",
        "title": "Kima successfully executes the first CBDC purchase of tokenized stocks on a stock exchange",
        "link": "https://www.newsbtc.com/news/kima-successfully-executes-the-first-cbdc-purchase-of-tokenized-stocks-on-a-stock-exchange/",
        "published": "5h ago",
        "content": "Kima completes the first CBDC transaction of a <b>tokenized</b> stock during the Bank of Israel event at the Tel Aviv Stock Exchange Kima&#39;s secure.",
        "summary": null,
        "ranking_score": 40
    },
    {
        "source": "Benzinga",
        "title": "'Institutions Are Ready To Play': How Blockchain Is Gaining Traction In Traditional Finance",
        "link": "https://www.benzinga.com/24/11/42218282/institutions-are-ready-to-play-how-blockchain-is-gaining-traction-in-traditional-finance",
        "published": "5h ago",
        "content": "DiRaimondo also touched on real estate <b>tokenization</b> as a transformative development. SteelWave&#39;s focus on <b>tokenized</b> real estate aims to make&nbsp;...",
        "summary": null,
        "ranking_score": 35
    },
    {
        "source": "CoinDesk",
        "title": "EU Approves Commissioners, Including Ones Who Will Likely Oversee Crypto Rules",
        "link": "https://www.coindesk.com/policy/2024/11/27/eu-approves-commissioners-including-ones-who-will-likely-oversee-crypto-rules",
        "published": "4h ago",
        "content": "<p>The European Parliament approved its slate of commissioners &lt;a href=&quot;https://www.europarl.europa.eu/news/en/press-room/20241121IPR25546/parliament-approves-the-von-der-leyen-ii-commission&quot; target=&quot;_blank&quot;&gt;on Wednesday&lt;/a&gt;, including the individuals who will be responsible for monitoring regulations around digital assets.</p><p>In September, European Parliament President Ursula Von der Leyen &lt;a href=&quot;https://ec.europa.eu/commission/presscorner/detail/en/ip_24_4723&quot; target=&quot;_blank&quot;&gt;proposed a list of commissioners&lt;/a&gt;. While crypto did not stand out as a core topic amongst the roles, this group will be responsible for ensuring digital asset rules are implemented.</p><p>The European Union (EU), a bloc of 27 nations, was the first major jurisdiction in the world to establish &lt;a href=&quot;https://www.coindesk.com/policy/2023/05/31/eu-formally-signs-new-crypto-licensing-money-laundering-rules-into-law/&quot; target=&quot;_blank&quot;&gt;a bespoke crypto legislative package last year, otherwise known as the Markets in Crypto Assets&lt;/a&gt; legislation (MiCA). &lt;a href=&quot;https://www.coindesk.com/policy/2024/06/27/eus-restrictive-stablecoin-rules-take-effect-soon-and-issuers-are-running-out-of-time/&quot; target=&quot;_blank&quot;&gt;Stablecoin rules came into force in June, while the rest of the rules are expected to come in force by December&lt;/a&gt;.</p><p>&quot;I don&apos;t expect a big legislative agenda in the blockchain space and in the digital space per se, over the next year or so,&quot; said Mark Foster, EU policy lead at the Crypto Council for Innovation.</p><p>Though no commissioner role is solely dedicated to crypto, the EU still has to ensure MiCA is being followed. Some commissioners will have digital assets fall within their remit as the nation advances its crypto rules, Foster said.</p><p>&quot;What the industry is really wanting is the EU to continue to discuss with its international partners and ensure that the rules that are being developed across the globe are to the extent possible, interoperable, consistent, and have the same goals,&quot; Foster said.</p><p>The commissioners have also been tasked with exploring whether or not more regulation is needed.</p><p>&quot;According, to MiCA, we are also required to present a report on the latest developments with respect to crypto assets, including an assessment of the necessity and feasibility of regulating decentralized finance activities, lending and borrowing of crypto assets, as well as non-fungible tokens,&quot; said Marcel Haag, director of Horizontal Policies at the European Commission, at a Crypto Council for Innovation Forum last week.</p><p>They will also have to decide whether or not to terminate the &lt;a href=&quot;https://www.esma.europa.eu/esmas-activities/digital-finance-and-innovation/dlt-pilot-regime&quot; target=&quot;_blank&quot;&gt;Distributed Ledger Technology&lt;/a&gt; pilot or make it permanent and review a proposal for establishing a legal framework for the digital euro, a central bank digital currency issued by the European Central Bank.</p><p>The commission is also set to launch a legal analysis on the suitability of member states&apos; legislation for financial asset tokenization, Haag said.</p><p>Read more: &lt;a href=&quot;https://www.coindesk.com/learn/mica-eus-comprehensive-new-crypto-regulation-explained/&quot; target=&quot;_blank&quot;&gt;MiCA, EU’s Comprehensive New Crypto Regulation, Explained&lt;/a&gt;</p><h2>The Commission</h2><p>The EU commission is the executive branch of the EU. Each member state has to select one person to form the commission.</p><p>Von der Leyen, who asked for a balanced gender group of commissioners, had the task of choosing what roles each person will take on for the next five years. People were appointed for roles on trade, climate, technology, economy, international partnership, finance and more.</p><p>Each commissioner will have their own focus, but Von der Leyen said in her &lt;a href=&quot;https://commission.europa.eu/about-european-commission/towards-new-commission-2024-2029/commissioners-designate-2024-2029_en&quot; target=&quot;_blank&quot;&gt;mission letters&lt;/a&gt; the priorities are not standalone and will affect each other.</p><p>Plus, crypto is a trans-sectoral topic, Faustine Fleuret, president of industry group ADAN that focuses on Web3 said, adding that they could &quot;engage with everyone&quot; in the commission when it comes to the sector.</p><p>Commissioners from Portugal, Finland and France will likely have some purview over crypto.</p><h2>Stéphane Séjourné</h2><p>France&apos;s Stéphane Séjourné has been chosen to be the executive vice-president for prosperity and industrial strategy, as well as the commissioner for industry, small and medium-sized enterprises (SMEs) and the single market.</p><p>This &lt;a href=&quot;https://commission.europa.eu/document/6ef52679-19b9-4a8d-b7b2-cb99eb384eca_en&quot; target=&quot;_blank&quot;&gt;job would include improving access to finance&lt;/a&gt;, simplifying the regulatory environment and promoting innovation for small and medium-sized enterprises. He will also oversee a project called the &quot;horizontal single market strategy&quot; that will require him to address barriers to the movement of goods and services abroad. His role could bring crypto under his oversight, Fleuret said.</p><p>Fleuret said she could see the industry pushing Web3 interests and positions on &quot;trade and economic safety, finance, the capital market union, innovation and research&quot; to Séjourné.</p><p>&quot;We had previous relations with Stéphane Séjourné during the MiCA negotiation, and at that stage, he was quite open to innovation,&quot; Fleuret said, adding that he believed in regulating the sector but knew not to hamper crypto with rules that were too strict.</p><h2>Maria Luís Albuquerque</h2><p>Portugal&apos;s &lt;a href=&quot;https://commission.europa.eu/document/ac06a896-2645-4857-9958-467d2ce6f221_en&quot; target=&quot;_blank&quot;&gt;Maria Luís Albuquerque&lt;/a&gt; will be the commissioner for financial services and the savings and investment union. Her work will include ensuring rules for the financial sector are enforced and improving the EU&apos;s supervisory system. She will work on improving digital finance and payments.</p><p>Plus, Albuquerque will ensure the enforcement of the &lt;a href=&quot;https://www.coindesk.com/policy/2024/04/26/eu-parliament-adopts-anti-money-laundering-rules-package-also-policing-crypto/&quot; target=&quot;_blank&quot;&gt;anti-money laundering package&lt;/a&gt; that targets large cash payments, crypto firms and more.</p><p>The EU has been considering doing &lt;a href=&quot;https://www.coindesk.com/policy/2022/06/27/nft-private-wallet-fates-hang-on-eu-crypto-talks-this-week/&quot; target=&quot;_blank&quot;&gt;a MiCA 2.0&lt;/a&gt; to address issues like crypto staking, lending and decentralized finance.</p><p>&quot;If the commission were to come up with new legislation specifically for digital assets, it would most likely be the Portuguese Commissioner Albuquerque,&quot; Foster said.</p><p>She might have to coordinate and get input from one of the executive vice presidents, which would most likely be Séjourné, Foster added.</p><p>&quot;She has a background in financial services. She&apos;s a former finance minister... So she&apos;s very experienced in traditional finance,&quot; Foster said. Her crypto views were not available online.</p><h2>Henna Virkkunen</h2><p>Another figure the industry thinks is important to watch out for is &lt;a href=&quot;https://commission.europa.eu/document/3b537594-9264-4249-a912-5b102b7b49a3_en&quot; target=&quot;_blank&quot;&gt;Finland&apos;s Henna Virkkunen&lt;/a&gt;.</p><p>&quot;We also think that one really important portfolio will be the one of Henna Virkkunen, who will be in charge of tech, sovereignty, security and democracy, because of all the related topics within Web3,&quot; Fleuret said.</p><p>Virkkunen&apos;s role will include boosting artificial intelligence innovation, looking at how digital technologies will enhance law enforcement capabilities, strengthening cybersecurity and taking enforcement action using the Digital Services Act where necessary to promote online safety. She &lt;a href=&quot;https://www.bloomberg.com/news/articles/2024-09-17/eu-picks-tech-enforcer-who-helped-write-its-social-media-rules?sref=3REHEaVI&quot; target=&quot;_blank&quot;&gt;will also have to work with Séjourné&lt;/a&gt;.</p><p>Read more: &lt;a href=&quot;https://www.coindesk.com/news-analysis/2024/06/28/elections-across-europe-wont-hinder-blocs-crypto-ambitions/&quot; target=&quot;_blank&quot;&gt;Elections Across Europe Won&apos;t Hinder Bloc&apos;s Crypto Ambitions&lt;/a&gt;</p>",
        "summary": "Content",
        "ranking_score": 35
    },
    {
        "source": "Abplive",
        "title": "Rwa Giant Rexas Finance Ends Presale Stage 7 Faster Than Predicted Raising $16250000",
        "link": "https://news.abplive.com/brand-wire/rwa-giant-rexas-finance-ends-presale-stage-7-faster-than-predicted-raising-16250000-where-to-buy-rxs-crypto-1734231",
        "published": "6h ago",
        "content": "Rexas Finance enables investors worldwide to own or fractionally invest in <b>real</b>-<b>world assets</b>. Source : Special Arrangement. New Delhi [India],&nbsp;...",
        "summary": null,
        "ranking_score": 30
    },
    {
        "source": "Cryptonews",
        "title": "Archax, Ripple Launch First Tokenized Money Market Fund on XRP Ledger",
        "link": "https://cryptonews.com/news/archax-ripple-launch-first-tokenized-money-market-fund-on-xrp-ledger/",
        "published": "8h ago",
        "content": "... (<b>RWA</b>) tokenisation”, said Archax in its X post from Nov. 25. Archax, in ... <b>RWA</b> Tokenization: A Booming Industry. The world of finance is&nbsp;...",
        "summary": null,
        "ranking_score": 30
    },
    {
        "source": "Thedefiant",
        "title": "Ripple Introduces Tokenized Money Market Fund on XRP Ledger in RWA Push",
        "link": "https://thedefiant.io/news/blockchains/ripple-introduces-tokenized-money-market-fund-on-xrp-ledger-in-rwa-push",
        "published": "9h ago",
        "content": "Ripple plans to allocate $5 million to purchase tokens representing shares in Abrdn&#39;s Lux fund.",
        "summary": null,
        "ranking_score": 30
    },
    {
        "source": "Coinedition",
        "title": "Hoskinson Details RWA Integration with Cardano's Midnight Upgrade",
        "link": "https://coinedition.com/hoskinson-details-rwa-integration-with-cardanos-midnight-upgrade/",
        "published": "10h ago",
        "content": "Proposed <b>RWA</b> integration and other factors behind ADA&#39;s recent rally. Cardano founder Charles Hoskinson says the blockchain is evolving into a&nbsp;...",
        "summary": null,
        "ranking_score": 30
    },
    {
        "source": "Tekedia",
        "title": "Will Solana (SOL) Price Reach $400 By Christmas? RWA Titan Rexas Finance (RXS) Sells ...",
        "link": "https://www.tekedia.com/will-solana-sol-price-reach-400-by-christmas-rwa-titan-rexas-finance-rxs-sells-out-7th-presale-stage-weeks-early-total-raise-hits-16-25-million/",
        "published": "10h ago",
        "content": "SOL shows potential to reach $400 by Christmas while <b>RWA</b> titan Rexas Finance (RXS) sells out the 7th presale stage weeks early, total raise hits&nbsp;...",
        "summary": null,
        "ranking_score": 30
    },
    {
        "source": "Crypto-reporter",
        "title": "Rexas Finance (RXS): RWA Titan Looking to Reshape $300 Trillion Real Estate Market Sells ...",
        "link": "https://www.crypto-reporter.com/press-releases/rexas-finance-rxs-rwa-titan-looking-to-reshape-300-trillion-real-estate-market-sells-out-presale-stage-7-total-raise-hits-16250000-83146/",
        "published": "11h ago",
        "content": "Rexas Finance (RXS), the rising titan in real-world asset (<b>RWA</b>) tokenization, is making waves in the $300 trillion real estate market. With Stage&nbsp;...",
        "summary": null,
        "ranking_score": 30
    },
    {
        "source": "Blockchainreporter",
        "title": "The R0AR Team Sets Out Path To Crypto RWA Success",
        "link": "https://blockchainreporter.net/the-r0ar-team-sets-out-path-to-crypto-rwa-success/",
        "published": "12h ago",
        "content": "R0AR is approaching the <b>RWA</b> space with a unique strategy, aiming to address these challenges head-on and unlock the full potential of tokenized real-&nbsp;...",
        "summary": null,
        "ranking_score": 30
    },
    {
        "source": "Bolsasymercados",
        "title": "SIX invests in OpenBrick, a digital platform of tokenized securities for real estate projects in Spain",
        "link": "https://www.bolsasymercados.es/ing/Media/Press-Release/20241127/nota_20241127_2/SIX_invests_in_OpenBrick__a_digital_platform_of_tokenized_securities_for_real_estate_projects_in_Spain",
        "published": "12h ago",
        "content": "Carlos Matilla, CEO of OpenBrick, highlights that &#39;OpenBrick facilitates financing through <b>tokenisation</b>, offering a new marketplace as a source of&nbsp;...",
        "summary": null,
        "ranking_score": 30
    },
    {
        "source": "Mondaq",
        "title": "Tokenisation: Information Hub Launched",
        "link": "https://www.mondaq.com/jersey/fund-finance/1548642/tokenisation-information-hub-launched",
        "published": "13h ago",
        "content": "<b>Tokenisation</b> is set to transform the funds sector and the Island of Jersey&#39;s role in this exciting space is growing.",
        "summary": null,
        "ranking_score": 30
    },
    {
        "source": "Mondaq",
        "title": "Podcast: Real-World Assets—A Digital Transformation",
        "link": "https://www.mondaq.com/jersey/fin-tech/1548656/podcast-real-world-assetsa-digital-transformation",
        "published": "13h ago",
        "content": "Digitisation in the asset management sector continues to evolve. According to a survey from Calastone, 67% of US managers expect to have <b>tokenised</b>&nbsp;...",
        "summary": null,
        "ranking_score": 30
    },
    {
        "source": "Mondovisione",
        "title": "SIX Invests In OpenBrick, A Digital Platform Of Tokenized Securities For Real Estate Projects In Spain",
        "link": "https://mondovisione.com/media-and-resources/news/six-invests-in-openbrick-a-digital-platform-of-tokenized-securities-for-real-es/",
        "published": "10h ago",
        "content": "BME today announced its investment in OpenBrick, a digital platform for the issuance, management, trading and settlement of <b>tokenized</b> securities&nbsp;...",
        "summary": null,
        "ranking_score": 30
    },
    {
        "source": "Dailycoin",
        "title": "Kima Completes Israel's First CBDC Tokenized Stock Purchase",
        "link": "https://dailycoin.com/kima-completes-israels-first-cbdc-tokenized-stock-purchase/",
        "published": "11h ago",
        "content": "Kima enabled the first CBDC purchase of a <b>tokenized</b> stock. The decentralized settlement layer showcased the practical use of CBDCs. A blockchain-based&nbsp;...",
        "summary": null,
        "ranking_score": 30
    },
    {
        "source": "Coinpedia",
        "title": "Ripple News: $3.8B Tokenized Fund Launches on XRPL",
        "link": "https://coinpedia.org/news/ripple-news-3-8b-tokenized-fund-launches-on-xrpl/",
        "published": "11h ago",
        "content": "Ripple and Archax launch the first <b>tokenized</b> money market fund on XRPL. Learn how <b>tokenized</b> assets could hit $16 trillion by 2030.",
        "summary": null,
        "ranking_score": 30
    },
    {
        "source": "Cryptopotato",
        "title": "Ripple and Archax Introduce First-Ever Tokenized Money Market Fund on the XRP Ledger",
        "link": "https://cryptopotato.com/ripple-and-archax-introduce-first-ever-tokenized-money-market-fund-on-the-xrp-ledger/",
        "published": "11h ago",
        "content": "Ripple and Archax expanded their collaboration in June, aiming to bring hundreds of millions of dollars in <b>tokenized</b> RWAs onto the XRPL. The main&nbsp;...",
        "summary": null,
        "ranking_score": 30
    },
    {
        "source": "Tronweekly",
        "title": "Ripple And Partners Launch $3.8B Tokenized Fund On XRPL",
        "link": "https://www.tronweekly.com/ripple-and-partners-launch-3-8b-tokenized-fund/",
        "published": "12h ago",
        "content": "Ripple, in collaboration with Archax and abrdn, has launched the first-ever <b>tokenized</b> money market fund on the XRP Ledger (XRPL).",
        "summary": null,
        "ranking_score": 30
    },
    {
        "source": "Nftgators",
        "title": "DeFi Points Tokenization App Rumpel Jumps 760% in a Month to $46M in TVL",
        "link": "https://www.nftgators.com/defi-points-tokenization-app-rumpel-jumps-760-in-a-month-to-46m-in-tvl/",
        "published": "14h ago",
        "content": "The platform positions itself as a point <b>tokenization</b> protocol. It allows users to <b>tokenize</b> off-chain loyalty points, which can then be traded on&nbsp;...",
        "summary": null,
        "ranking_score": 30
    },
    {
        "source": "Bitcoinist",
        "title": "Ripple Announces First Tokenized Money Market Fund On The XRP Ledger",
        "link": "https://bitcoinist.com/ripple-first-tokenized-money-market-fund-xrp-ledger/",
        "published": "15h ago",
        "content": "Ripple Labs has introduced the first <b>tokenized</b> money market fund on the XRP Ledger (XRPL). The initiative, in partnership with Archax and UK-based&nbsp;...",
        "summary": null,
        "ranking_score": 30
    },
    {
        "source": "U",
        "title": "XRP Ledger (XRPL) Hosts First Ripple-Backed Tokenized Fund",
        "link": "https://u.today/xrp-ledger-xrpl-hosts-first-ripple-backed-tokenized-fund",
        "published": "16h ago",
        "content": "... <b>tokenized</b> money market fund on the XRP Ledger. With $16T in <b>tokenized</b> assets projected by 2030, this milestone unlocks cost savings and settlement&nbsp;...",
        "summary": null,
        "ranking_score": 30
    },
    {
        "source": "Cryptoslate",
        "title": "Ripple launches first tokenized money market fund on XRP ledger through UK partnership",
        "link": "https://cryptoslate.com/ripple-launches-first-tokenized-money-market-fund-on-xrp-ledger-through-uk-partnership/",
        "published": "16h ago",
        "content": "The global RWA <b>tokenization</b> market is witnessing rapid growth, with McKinsey projecting it to exceed $16 trillion by 2030. <b>Tokenized</b> money market&nbsp;...",
        "summary": null,
        "ranking_score": 30
    },
    {
        "source": "Crypto-economy",
        "title": "RWA Market Surges as Tokenized U.S. Treasuries Hit $2.5 Billion",
        "link": "https://crypto-economy.com/rwa-market-surges-as-tokenized-u-s-treasuries-hit-2-5-billion/",
        "published": "18h ago",
        "content": "The total value of <b>tokenized</b> RWA assets exceeds $13 billion, highlighting the growing demand for the <b>tokenization</b> of traditional assets.",
        "summary": null,
        "ranking_score": 30
    },
    {
        "source": "Cryptoglobe",
        "title": "Ripple and Archax Launch First Tokenized Money Market Fund on XRP Ledger (XRPL)",
        "link": "https://www.cryptoglobe.com/latest/2024/11/ripple-and-archax-launch-first-tokenized-money-market-fund-on-xrp-ledger-xrpl/",
        "published": "20h ago",
        "content": "Archax partners with Ripple to <b>tokenize</b> abrdn&#39;s £3.8B Liquidity Fund on the XRP Ledger, showcasing XRPL&#39;s institutional-grade blockchain&nbsp;...",
        "summary": null,
        "ranking_score": 30
    },
    {
        "source": "Analyticsinsight",
        "title": "XRP Retraces to 1.3 Support Level Amid Institutional Adoption and Tokenized Assets",
        "link": "https://www.analyticsinsight.net/stocks/xrp-retraces-to-13-support-level-amid-institutional-adoption-and-tokenized-assets-key-levels-to-watch",
        "published": "20h ago",
        "content": "XRP shows bullish potential as analysts predict a rally to $1.60 and beyond, driven by institutional adoption, <b>tokenized</b> asset partnerships,&nbsp;...",
        "summary": null,
        "ranking_score": 30
    },
    {
        "source": "Altcoinbuzz",
        "title": "Archax Launches $3.8B Tokenized Fund on XRP",
        "link": "https://www.altcoinbuzz.io/cryptocurrency-news/archax-launches-3-8b-tokenized-fund-on-xrp/",
        "published": "20h ago",
        "content": "The $3.8 billion <b>tokenized</b> fund on XRP is preparing us for what&#39;s to come next. <b>Tokenized</b> assets are here to stay.",
        "summary": null,
        "ranking_score": 30
    },
    {
        "source": "Coinspeaker",
        "title": "Best Cryptos For Passive Income: Why Dreamcars' Crypto Presale Tops The List",
        "link": "https://www.coinspeaker.com/best-cryptos-for-passive-income-dreamcars-tops-the-list/",
        "published": "2h ago",
        "content": "... <b>real</b>-<b>world assets</b>. Investors earn monthly passive income paid in USDT on the first of each month, creating a reliable and rewarding experience&nbsp;...",
        "summary": null,
        "ranking_score": 25
    },
    {
        "source": "Fintech",
        "title": "Interactive investor integrates NatWest's Payit for seamless open banking payments",
        "link": "https://fintech.global/2024/11/27/interactive-investor-integrates-natwests-payit-for-seamless-open-banking-payments/",
        "published": "6h ago",
        "content": "Previous articleOpenTrade secures $4m to expand <b>real</b>-<b>world asset</b>-backed stablecoin products.",
        "summary": null,
        "ranking_score": 25
    },
    {
        "source": "Themalaysianreserve",
        "title": "A Report shows that stablecoins will be crucial for advancing Hong Kong's position as a ...",
        "link": "https://themalaysianreserve.com/2024/11/27/a-report-shows-that-stablecoins-will-be-crucial-for-advancing-hong-kongs-position-as-a-leading-web3-hub-regulations-are-the-key-to-mass-adoption/",
        "published": "7h ago",
        "content": "... <b>real</b>-<b>world</b> applications, especially local and cross-border payments. ... <b>assets</b> like stablecoin as a mainstream payment option.” As a result&nbsp;...",
        "summary": null,
        "ranking_score": 25
    },
    {
        "source": "Theblock",
        "title": "Tether to end support for EURT stablecoin citing MiCA regulations, falling demand",
        "link": "https://www.theblock.co/amp/post/328483/tether-discontinues-eurt",
        "published": "7h ago",
        "content": "... <b>real</b>-<b>world asset</b> tokenization platform, Hadron. The impact of the EU&#39;s MiCA regulations. The EU&#39;s Markets in Crypto-Assets regulation (MiCA)&nbsp;...",
        "summary": null,
        "ranking_score": 25
    },
    {
        "source": "Fintech",
        "title": "OpenTrade secures $4m to expand real-world asset-backed stablecoin products",
        "link": "https://fintech.global/2024/11/27/opentrade-secures-4m-to-expand-real-world-asset-backed-stablecoin-products/",
        "published": "7h ago",
        "content": "OpenTrade, a London-based platform specialising in <b>real</b>-<b>world asset</b>-backed stablecoin yield products, has raised $4m in a seed extension round led&nbsp;...",
        "summary": null,
        "ranking_score": 25
    },
    {
        "source": "Blockster",
        "title": "$GTAI Token Climbs to New Heights as Community Power Drives Momentum",
        "link": "https://blockster.com/gtai-token-climbs-to-new-heights-as-community-power-drives-momentum",
        "published": "6h ago",
        "content": "OpenTrade Secures $4M Seed Extension to Scale <b>RWA</b>-Backed Lending &amp; Stablecoin Yield Solutions. November 25, 2024. 2,025 views &middot; Tech. YeagerAI&nbsp;...",
        "summary": null,
        "ranking_score": 25
    },
    {
        "source": "Chaincatcher",
        "title": "Matrixdock has partnered with Avalon Finance to launch the gold token XAUm for over ...",
        "link": "https://www.chaincatcher.com/en/article/2153952",
        "published": "15h ago",
        "content": "ChainCatcher news, Matrixdock, a leading <b>RWA</b> tokenization platform under Matrixport, announced a partnership with Avalon Finance, making its gold&nbsp;...",
        "summary": null,
        "ranking_score": 25
    },
    {
        "source": "Marketsmedia",
        "title": "Zodia Custody and Securitize Join Forces",
        "link": "https://www.marketsmedia.com/zodia-custody-and-securitize-join-forces/",
        "published": "11h ago",
        "content": "... <b>tokenisation</b>. Zodia Custody will leverage Securitize&#39;s cutting-edge technology to increase custody support for asset owners who hold digital&nbsp;...",
        "summary": null,
        "ranking_score": 25
    },
    {
        "source": "Cryptodnes",
        "title": "Crypto Experts Predict Unprecedented Bull Market in 2025",
        "link": "https://cryptodnes.bg/en/crypto-experts-predict-unprecedented-bull-market-in-2025/",
        "published": "2h ago",
        "content": "... <b>tokenization</b>, artificial intelligence, and more. Svanevik envisions a significant resurgence in decentralized finance (DeFi), driven by increased&nbsp;...",
        "summary": null,
        "ranking_score": 25
    },
    {
        "source": "Coinpedia",
        "title": "Tether-Backed Northern Data Striking Deals To Sell Its Crypto-Mining Arm: Bloomberg",
        "link": "https://coinpedia.org/news/tether-backed-northern-data-striking-deals-to-sell-its-crypto-mining-arm-bloomberg/",
        "published": "2h ago",
        "content": "Tether-Backed Northern Data Striking Deals To Sell Its Crypto-Mining Arm: Bloomberg. Tether Launches Hadron; Aims To Make Asset <b>Tokenization</b> More&nbsp;...",
        "summary": null,
        "ranking_score": 25
    },
    {
        "source": "Blockchainreporter",
        "title": "Mansa Finance, Clearpool Partners to Rollout DeFi Trade-Finance on Ozean blockchain",
        "link": "https://blockchainreporter.net/mansa-finance-clearpool-partners-to-rollout-defi-trade-finance-on-ozean-blockchain/",
        "published": "6h ago",
        "content": "<b>Tokenization</b> can transform cross-border transactions and finance trade by making them more affordable, secure, and efficient. Real-world assets, like&nbsp;...",
        "summary": null,
        "ranking_score": 25
    },
    {
        "source": "Binance",
        "title": "Shiba Inu (SHIB) Bulls Charge As SHIB Accumulation Hints At a 200% Rally",
        "link": "https://www.binance.com/en/square/post/16807007822633",
        "published": "6h ago",
        "content": "A no-code tool called Token Builder lets users quickly <b>tokenize</b> assets. Rexas Launchpad: New <b>tokenized</b> project financing tool. Supporting ERC-20, ERC-&nbsp;...",
        "summary": null,
        "ranking_score": 25
    },
    {
        "source": "CoinDesk",
        "title": "Tether to Shutter Euro Stablecoin as Key MiCA Deadline Looms",
        "link": "https://www.coindesk.com/business/2024/11/27/tether-to-shutter-euro-stablecoin-as-key-mi-ca-deadline-looms",
        "published": "7h ago",
        "content": "<p>Stablecoin issuing giant Tether is closing down its euro stablecoin, EURT.</p><p>&quot;After careful consideration, we have made the decision to discontinue support for EUR₮,&quot; the firm said in a &lt;a href=&quot;https://tether.io/news/tether-updates-users-on-a-strategic-transition-to-better-support-community-driven-product-support/&quot; target=&quot;_blank&quot;&gt;press release&lt;/a&gt; on Wednesday. Users will be able to redeem tokens until Nov. 27, 2025, the post added.</p><p>The decision comes as digital asset businesses operating in the EU are in crunch time before region-wide regulations, known as &lt;a href=&quot;https://www.coindesk.com/learn/mica-eus-comprehensive-new-crypto-regulation-explained/&quot; target=&quot;_blank&quot;&gt;MiCA&lt;/a&gt;, enter into full force by the end of this year.\n\nMiCA requires stablecoin issuers to get compliant or potentially retreat from the market of 450 million consumers. Tether CEO Paolo Ardoino has been a &lt;a href=&quot;https://cointelegraph.com/news/mica-regulation-systemic-risk-banking-system-tether-ceo&quot; target=&quot;_blank&quot;&gt;vocal critic&lt;/a&gt; of the new rules and the company has not obtained the necessary Electronic Money Institution (EMI) license to operate in the EU. Meanwhile, rival issuer Circle, the company behind the $36 billion market cap USDC, &lt;a href=&quot;https://www.businesswire.com/news/home/20240701820713/en/&quot; target=&quot;_blank&quot;&gt;said&lt;/a&gt; it fulfilled the requirements to operate in the region.</p><p>EURT didn&apos;t attract considerable demand in the euro stablecoin market. It only has a $27 million market capitalization, per CoinGecko data, lagging behind Circle&apos;s EURC $90 million and Stasis Euro&apos;s $130 million. In comparison, Tether&apos;s flagship stablecoin USDT has a $132 billion market capitalization.</p><p>Tether recently &lt;a href=&quot;https://www.coindesk.com/business/2024/11/18/kraken-tether-backed-dutch-firm-rolls-out-mica-compliant-euro-us-dollar-stablecoins&quot; target=&quot;_blank&quot;&gt;invested&lt;/a&gt; in Netherlands-based stablecoin issuer Quantoz and also &lt;a href=&quot;https://www.coindesk.com/business/2024/11/14/tether-unveils-new-platform-to-simplify-asset-tokenization-for-businesses-nation-states&quot; target=&quot;_blank&quot;&gt;launched&lt;/a&gt; a tokenization platform, Hadron, that aims to support smaller, MiCA-compliant stablecoin companies to issue tokens.</p><p>&quot;At this time we will be focusing our support on new ventures such as the launch of Quantoz Payments’ revolutionary MiCAR-compliant stablecoins, EURQ, and USDQ which will be powered by Tether’s advanced technology solution, Hadron by Tether,&quot; the firm said in a statement.</p>",
        "summary": "Content",
        "ranking_score": 25
    },
    {
        "source": "CoinDesk",
        "title": "Stablecoins Hit Record $190B Market Cap, Surpassing Pre-Terra Crash Peak: CCData",
        "link": "https://www.coindesk.com/markets/2024/11/27/stablecoins-hit-record-190-b-market-cap-surpassing-pre-terra-crash-peak-cc-data",
        "published": "9h ago",
        "content": "<p>Following &lt;a href=&quot;https://www.coindesk.com/markets/2024/11/22/bitcoin-nears-100k-with-crypto-market-cap-at-record-34t/&quot; target=&quot;_blank&quot;&gt;bitcoin&lt;/a&gt; (&lt;a href=&quot;https://www.coindesk.com/price/bitcoin&quot; target=&quot;_blank&quot;&gt;BTC&lt;/a&gt;) and &lt;a href=&quot;https://www.coindesk.com/markets/2024/11/22/solanas-sol-surges-to-record-high-above-260&quot; target=&quot;_blank&quot;&gt;solana&lt;/a&gt; (&lt;a href=&quot;https://www.coindesk.com/price/solana&quot; target=&quot;_blank&quot;&gt;SOL&lt;/a&gt;) reaching all-time high prices earlier this month, the stablecoin sector has now joined crypto&apos;s record-breaking streak.</p><p>The combined market size of stablecoins hit $190 billion this month for the first time ever, Wednesday&apos;s &lt;a href=&quot;https://ccdata.io/reports/stablecoins-cbdcs-report-november-2024&quot; target=&quot;_blank&quot;&gt;report&lt;/a&gt; by digital asset analytics firm CCData noted. CCData is owned by Bullish, CoinDesk&apos;s parent company. The previous peak of $188 billion was recorded in April 2022, just before the cataclysmic implosion of the &lt;a href=&quot;https://www.coindesk.com/learn/the-fall-of-terra-a-timeline-of-the-meteoric-rise-and-crash-of-ust-and-luna/&quot; target=&quot;_blank&quot;&gt;Terra-Luna stablecoin&lt;/a&gt; that added fuel to the digital asset bear market now referred to as crypto winter.</p><p>&lt;a href=&quot;https://www.coindesk.com/markets/2024/11/12/stablecoin-supply-expands-by-5b-since-us-election-as-investors-pile-into-crypto&quot; target=&quot;_blank&quot;&gt;Demand for stablecoins&lt;/a&gt; soared as cryptocurrency prices exploded in November as investors rushed into crypto, expecting that the U.S. government will be friendlier toward the industry following Donald Trump&apos;s election victory. Stablecoins are a key piece of plumbing in the crypto ecosystem. With their prices anchored to an external asset, predominantly the U.S. dollar, they are a popular source of liquidity for crypto trading, serving as dry powder on exchanges.</p><p>Read more: &lt;a href=&quot;https://www.coindesk.com/business/2024/09/12/stablecoins-increasingly-used-for-savings-payments-in-emerging-countries-but-crypto-trading-still-leads-report&quot; target=&quot;_blank&quot;&gt;Stablecoins Increasingly Used for Savings, Payments in Emerging Countries, but Crypto Trading Still Leads&lt;/a&gt;</p><p>This year also brought an explosion of novel tokenized products with prices also pegged to $1, including tokenized money market funds like BlackRock&apos;s BUIDL and investment strategies wrapped into a token like Ethena&apos;s &quot;synthetic dollar&quot; USDe, which is backed by a crypto carry trade. The CCData report included these platforms in the tally.</p><p>Tether&apos;s &lt;a href=&quot;https://www.coindesk.com/price/tether&quot; target=&quot;_blank&quot;&gt;USDT&lt;/a&gt; continues to dominate the stablecoin sector. The token&apos;s market cap rose 10% over the past month to a new peak of $132 billion, CCData noted. Meanwhile, Circle&apos;s &lt;a href=&quot;https://www.coindesk.com/price/usd-coin&quot; target=&quot;_blank&quot;&gt;USDC&lt;/a&gt;, grew 12% to a nearly $39 billion market cap, the highest since the March 2023 regional banking crisis that &lt;a href=&quot;https://www.coindesk.com/markets/2023/03/11/usdc-stablecoin-and-crypto-market-go-haywire-after-silicon-valley-bank-collapses&quot; target=&quot;_blank&quot;&gt;heavily impacted&lt;/a&gt; the token. USDT claims a 69.9% market share currently, while USDC is second-largest with a 20.5% share.</p><p>It was not just the top two that saw rapid growth: 38 of the nearly 200 tokens tracked made a new all-time high supply over the past month, CCData said.</p><img alt=\"\" src=\"https://cdn.sanity.io/images/s3y3vcno/production/1b8c6f3a5c3ff4f229f3903007988134fab434d7-2196x706.png\" /><p>Ethena&apos;s USDe, for example, saw a 42% increase to a new record of $3.8 billion in November. The token generates yield to investors by holding spot BTC and ETH and simultaneously shorting (selling) an equal amount of perpetual futures farming the funding rate. Ethena &lt;a href=&quot;https://app.ethena.fi/&quot; target=&quot;_blank&quot;&gt;now&lt;/a&gt; offers 25% annualized yield (APY) to token holders, as frothy crypto markets elevated funding rates, &lt;a href=&quot;https://www.coindesk.com/markets/2024/11/19/ethena-sees-1b-inflows-as-crypto-rally-brings-back-double-digit-yields&quot; target=&quot;_blank&quot;&gt;benefitting the protocol&lt;/a&gt;.</p><p>The broad-market crypto rally also boosted trading volumes with stablecoin pairs on centralized exchanges, rising 77% month-over-month to $1.8 trillion, the report said. USDT was responsible for about 83% of the volumes, followed by Hong Kong-based First Digital&apos;s &lt;a href=&quot;https://www.coindesk.com/markets/2023/06/01/first-digital-unveils-usd-stablecoin-as-hong-kong-crypto-rules-kick-in&quot; target=&quot;_blank&quot;&gt;FDUSD&lt;/a&gt; 9% and USDC&apos;s 8% share.</p>",
        "summary": "Content",
        "ranking_score": 25
    },
    {
        "source": "CryptoSlate",
        "title": "Tether to shutter EURt to focus on Hadron amid regulatory challenges in Europe",
        "link": "https://cryptoslate.com/tether-to-focus-on-hadron-as-it-exits-eurt-amid-regulatory-challenges-in-europe/",
        "published": "6h ago",
        "content": "<p>Stablecoin issuer Tether announced plans to end support for its Euro-pegged stablecoin, <a href=\"https://cryptoslate.com/coins/tether-eurt/\">EURt</a>, in a Nov. 27 statement.</p>\n<p>The company stated it had ceased minting new EURt tokens, with the last issuance request processed in 2022. It also continued that the asset&#8217;s current holders can redeem the tokens until Nov. 27, 2025.</p>\n<p>The decision marks the end of EURt&#8217;s challenging journey in a market where competitors like Circle&#8217;s MiCA-compliant EURC dominate.</p>\n<p>According to <em>CryptoSlate&#8217;s</em> <a href=\"https://cryptoslate.com/cryptos/eur-stablecoin/\">data</a>, EURt struggled to gain traction in Europe, holding a market capitalization of just $38 million. This figure trails <a href=\"https://cryptoslate.com/coins/euro-coin/\">Circle&#8217;s EURC</a>, valued at $90.5 million, and <a href=\"https://cryptoslate.com/coins/stasis-euro/\">Stasis&#8217; Euro</a>, which boasts a $130 million valuation.</p>\n<p>In stark contrast, Tether&#8217;s flagship stablecoin, USDt, commands a robust $132 billion market cap—  more than three times higher than its closest competitor, USDC.</p>\n<h2>Why Tether is ending EURt support</h2>\n<p>Tether CEO <a href=\"https://cryptoslate.com/people/paolo-ardoino/\">Paolo Ardoino</a> attributed the move to Europe&#8217;s evolving regulatory landscape for stablecoins.</p>\n<p>The EU&#8217;s Markets in Crypto-Assets Regulation (MiCA) introduces a stringent regulatory environment that requires stablecoin issuers to obtain e-money authorization in at least one EU member country. This law has drawn significant backlash from Ardoino, who claims the strict cash reserve requirements could present systemic risks to banks and digital assets.</p>\n<p>Ardoino emphasized the need for a framework that balances risk management with innovation and user protection. He stated:</p>\n<blockquote><p>&#8220;Tether&#8217;s decision to delist EURt has not been taken lightly, but until a more risk-averse regulatory framework in Europe is in place—one that fosters innovation, offers the stability and protection our users deserve and avoids potential banking systemic risks—we have chosen to prioritize other initiatives.&#8221;</p></blockquote>\n<p>While Tether might not comply with MiCA, Ardoino pointed out that the firm&#8217;s new initiative, Hadron, will be a top priority in the European region. According to him, Hadron has the potential to revolutionize the accessibility of asset tokenization for institutions, governments, fund managers, and private companies.</p>\n<p>Dutch fintech firm Quantoz has already <a href=\"https://cryptoslate.com/tether-invests-in-dutch-firm-to-launch-mica-compliant-stablecoins/\">leveraged Hadron to issue EURQ and USDQ stablecoins</a>. These tokens fully comply with the EU&#8217;s Markets in Crypto-Assets Regulation (MiCA), demonstrating the platform&#8217;s adaptability to stringent regulatory requirements.</p>\n<p>The post <a href=\"https://cryptoslate.com/tether-to-focus-on-hadron-as-it-exits-eurt-amid-regulatory-challenges-in-europe/\">Tether to shutter EURt to focus on Hadron amid regulatory challenges in Europe</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>",
        "summary": "<p>Stablecoin issuer Tether announced plans to end support for its Euro-pegged stablecoin, EURt, in a Nov. 27 statement. The company stated it had ceased minting new EURt tokens, with the last issuance request processed in 2022. It also continued that the asset&#8217;s current holders can redeem the tokens until Nov. 27, 2025. The decision marks the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/tether-to-focus-on-hadron-as-it-exits-eurt-amid-regulatory-challenges-in-europe/\">Tether to shutter EURt to focus on Hadron amid regulatory challenges in Europe</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>",
        "ranking_score": 25
    },
    {
        "source": "CryptoSlate",
        "title": "Ripple invests in Bitwise XRP fund amid new XRPL Foundation launch",
        "link": "https://cryptoslate.com/ripple-invests-in-bitwise-xrp-fund-amid-new-xrpl-foundation-launch/",
        "published": "7h ago",
        "content": "<p>Blockchain firm <a href=\"https://cryptoslate.com/companies/ripple/\">Ripple</a> is among the four founding members of the newly incorporated XRP Ledger (XRPL) Foundation.</p>\n<p>Established on Nov. 26 in France, the <a href=\"https://xrpl.org/blog/2024/a-new-era-for-the-xrp-ledger\">organization</a> aims to unify and govern the broader XRPL ecosystem. The foundation brings together Ripple, XRPL Labs, XRPL Commons, the former XRPL Foundation, and key members of the XRP community.</p>\n<p>The foundation is committed to ensuring long-term growth, security, and decentralized contributions to the XRPL. Its primary mission is to foster a thriving, inclusive, and resilient XRPL community. Developers and users will have a trusted platform to create decentralized applications, financial tools, and blockchain infrastructure.</p>\n<p>The group&#8217;s initial focus will be reclaiming assets from the previous XRPL Foundation. It also plans to implement a governance model representing developers, users, validators, academia, and infrastructure providers. Key contributors—including XRPL Commons, XRPL Labs, Ripple, and XAO DAO—will guide the foundation through board representation and decision-making roles.</p>\n<p>The XRPL blockchain continues to gain traction for its scalability, low costs, and regulatory compliance. Notably, its growing <a href=\"https://cryptoslate.com/ripple-launches-first-tokenized-money-market-fund-on-xrp-ledger-through-uk-partnership/\">role in tokenizing real-world assets (RWAs)</a> has attracted major institutional players like <a href=\"https://cryptoslate.com/societe-generale-expands-its-stablecoin-to-ripples-xrp-ledger-to-drive-further-adoption/\">SG-FORGE, the crypto division of Societe Generale.</a></p>\n<h2>Support for Bitwise XRP Fund</h2>\n<p>Meanwhile, Ripple is also ramping up support for <a href=\"https://cryptoslate.com/coins/xrp/\">XRP</a> through a strategic investment in <a href=\"https://cryptoslate.com/companies/bitwise/\">Bitwise&#8217;s</a> newly rebranded Physical XRP Exchange-Traded Product (ETP).</p>\n<p>Formerly known as ETC Group Physical XRP, the product exposes European investors to XRP through a physically backed structure holding the token.</p>\n<p>Bitwise CEO <a href=\"https://cryptoslate.com/people/hunter-horsley/\">Hunter Horsley</a> emphasized XRP&#8217;s reputation as one of the most recognized and reliable blockchain networks. He <a href=\"https://etc-group.com/newsroom/Press_Release_27_11_2024/\">added</a>:</p>\n<blockquote><p>&#8220;XRP and the XRP Ledger are among the most familiar and trusted blockchains in crypto. XRPL is unique with over 10 years of track record in reliability, while continuing to expand in capabilities.&#8221;</p></blockquote>\n<p>Ripple CEO <a href=\"https://cryptoslate.com/people/brad-garlinghouse/\">Brad Garlinghouse</a> echoed this sentiment while noting a surge in global demand for crypto-backed investment products. He noted that recent regulatory clarity in the US will likely accelerate this trend, further boosting interest in offerings like the Bitwise Physical XRP ETP.</p>\n<p>The post <a href=\"https://cryptoslate.com/ripple-invests-in-bitwise-xrp-fund-amid-new-xrpl-foundation-launch/\">Ripple invests in Bitwise XRP fund amid new XRPL Foundation launch</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>",
        "summary": "<p>Blockchain firm Ripple is among the four founding members of the newly incorporated XRP Ledger (XRPL) Foundation. Established on Nov. 26 in France, the organization aims to unify and govern the broader XRPL ecosystem. The foundation brings together Ripple, XRPL Labs, XRPL Commons, the former XRPL Foundation, and key members of the XRP community. The [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ripple-invests-in-bitwise-xrp-fund-amid-new-xrpl-foundation-launch/\">Ripple invests in Bitwise XRP fund amid new XRPL Foundation launch</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>",
        "ranking_score": 25
    },
    {
        "source": "BlockWorks",
        "title": "Sui, Aptos vie for ‘next Solana’ status",
        "link": "https://blockworks.co/news/sui-aptos-compete-for-next-solana-title",
        "published": "unknown time",
        "content": "<p><br /><em>This is a segment from the 0xResearch newsletter. To read full editions, </em><a href=\"https://blockworks.co/newsletter/research\"><em>subscribe</em></a><em>.</em></p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p>As SOL <a href=\"https://blockworks.co/news/solana-sets-all-time-high-of-263\">reached</a> new all-time highs yesterday, Crypto Twitter’s search for the “next Solana” is on.</p>\n\n\n\n<p>There is no shortage of <a href=\"https://x.com/chainyoda/status/1849835317022327039\">mega fast alt-L1s</a> to pick from, but in the spotlight are two contenders: MoveVM-based chains Sui and Aptos. Both chains were born in the previous crypto cycle, and built by teams with backgrounds in Facebook, which developed the Move programming language as part of its <a href=\"https://blockworks.co/news/facebook-led-crypto-project-diem-to-be-sold-off-for-200m-report\">Libra</a> (later renamed Diem) project.</p>\n\n\n\n<p>In terms of price action, SUI has outperformed APT by a large margin on a YTD basis after overtaking Aptos in market cap in mid-September.</p>\n\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXcjcTtlwYopTYE2yOIskjzWcqBxEx7D7aBC_Cjmo7doI9Mx2sGFD_tmiAX-9CXtrLg8F-nrgo3qB8gu7C0WH7B0kXRSina0C8LbETBYgqgpCbzhDchR_OEmm95Xj0vEt9oFpjg56g?key=iZHG-iO_AQDsFz_3x3YWxSrN\" /><figcaption class=\"wp-element-caption\"><em>Source: <a href=\"https://coinmarketcap.com/currencies/sui/\">CoinMarketCap</a></em></figcaption></figure>\n\n\n\n<p>Despite <a href=\"https://x.com/SuiNetwork/status/1859705664362381559\">suffering</a> a brief two-hour outage yesterday, SUI’s price has bounced back above its pre-outage price levels, ironically reinforcing the mimetic perception of Sui as the next Solana due to the latter’s <a href=\"https://blockworks.co/news/solana-downtime-post-mortem\">history of outages</a>.</p>\n\n\n\n<p>In terms of TVL, Sui and Aptos are running fairly neck to neck (see below chart), no doubt thanks to ongoing <a href=\"https://blockworks-research.beehiiv.com/p/saving-self-custody\">liquidity incentive</a> campaigns. As far as active dapps on the L1s, both are also fairly even — Sui has 44, Aptos has 49 — based on <a href=\"https://defillama.com/chains\">DefiLlama</a>’s numbers.</p>\n\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXenOdwIIajIY7bxP-U5Oe2jAvhqq6dNLszfvbjNUIgadp9x6CHSxu_2dlV0pPzSZioxukKuownLe4b7GM8KFobhzgyum61mUZJs0MPFxad7uSP4nGil8eEYhtqVT0wwk7-XlMkGMQ?key=iZHG-iO_AQDsFz_3x3YWxSrN\" /><figcaption class=\"wp-element-caption\"><em>Source: <a href=\"https://app.artemisanalytics.com/chains?selectedChains=aptos%2Csui\">Artemis</a></em></figcaption></figure>\n\n\n\n<p>Zooming into onchain activity, Sui’s DEX trading volumes saw a 3x jump since September, overtaking Aptos by a long shot in the last month.</p>\n\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXdqJQVqlSwzCgw26lUiBjulWHrTAzbtTU9Z3rZiWH4xCH65HHT4yRZPpL9tycA9teh8gpP8gt96fPn2FehQUim60H6vtfR9vF9CTmEAv912j6yo2Vw1y7hRS3uT4KuthdzDufkxeQ?key=iZHG-iO_AQDsFz_3x3YWxSrN\" /><figcaption class=\"wp-element-caption\"><em>Source: <a href=\"https://app.artemisanalytics.com/chains?selectedChains=aptos%2Csui\">Artemis</a></em></figcaption></figure>\n\n\n\n<p>In terms of fees, Sui is also far outpacing Aptos, with $1.1 million generated in October alone, vs. $196k for Aptos.</p>\n\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXfLuhT9H7k7HvC4fz6DK0LnfWjbr5DtUcpH3n9xaFYNu1GZavbAqJaor7tQb4RpP_7nFu5dDHCWY3B-VMaC7C4v5zkDdBuFBuW9Ln0QeMHw2My3F3UwOf1ccJM4jRrpstaRZ2J_qA?key=iZHG-iO_AQDsFz_3x3YWxSrN\" /><figcaption class=\"wp-element-caption\"><em>Source: <a href=\"https://app.artemisanalytics.com/chains?selectedChains=aptos%2Csui\">Artemis</a></em></figcaption></figure>\n\n\n\n<p>In the TradFi arena, both chains are pursuing real-world assets. Ondo has deployed its USDY tokenized Treausurys product on both chains, with about $8.3 million on Sui and <a href=\"https://app.rwa.xyz/networks/aptos\">$15.7 million</a> on Aptos.&nbsp;</p>\n\n\n\n<p>Aptos also announced last week BlackRock’s <a href=\"https://aptosfoundation.org/currents/blackrock-buidl-fund-live-on-aptos\">deployment</a> of its tokenized RWA BUIDL fund, while Sui <a href=\"https://blog.sui.io/franklin-templeton-digital-assets-strategic-partnership/\">announced</a> today a partnership with the digital assets arm of Franklin Templeton to support ecosystem growth.</p>\n\n\n\n<p>Finally, both Sui and Aptos are attempting their own hardware plays. Sui is leaning hard into the gaming sector with its handheld console <a href=\"https://blockworks.co/news/sui-playtron-handheld-web3-gaming-device\">SuiPlay0x1</a>, and earlier this month struck up a partnership with the global esports team <a href=\"https://blog.sui.io/team-liquid-myblue-blue-fan-platform/\">Team Liquid</a>, while Aptos has taken the route of a <a href=\"https://aptosfoundation.org/currents/aptos-foundation-partners-with-jambo-to-empower-emerging-markets-through-web3\">budget-priced JamboPhone smartphone</a>.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p><strong>Start your day with top crypto insights from David Canellis and Katherine Ross. <a href=\"https://blockworks.co/newsletter/empire\">Subscribe to the Empire newsletter</a>.</strong></p>\n\n\n\n<p><strong>Explore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. <a href=\"https://blockworks.co/newsletter/onthemargin\">Subscribe to the Forward Guidance newsletter</a>.</strong></p>\n\n\n\n<p><strong>Get alpha directly in your inbox with the <a href=\"https://blockworks.co/newsletter/research\">0xResearch newsletter</a> — market highlights, charts, degen trade ideas, governance updates, and more.</strong></p>\n\n\n\n<p><strong>The Lightspeed newsletter is all things Solana, in your inbox, every day. <a href=\"https://blockworks.co/newsletter/lightspeed\">Subscribe to daily Solana news</a> from Jack Kubinec and Jeff Albus.</strong></p>",
        "summary": "SUI has outperformed APT by a large margin on a YTD basis after overtaking Aptos in market cap in mid-September",
        "ranking_score": 20
    },
    {
        "source": "BlockWorks",
        "title": "Solana is excited about new stablecoin infrastructure provider Perena",
        "link": "https://blockworks.co/news/solana-stablecoin-infra-provider",
        "published": "unknown time",
        "content": "<p><br /><em>This is a segment from yesterday’s Lightspeed newsletter. To read full editions, </em><a href=\"https://blockworks.co/newsletter/lightspeed\"><em>subscribe</em></a><em>.</em></p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p>When I talk to Solana ecosystem people, I’ll sometimes ask what new projects they’ve been hearing about. One such project that’s been catching apparent buzz is Perena, a stablecoin infrastructure protocol.</p>\n\n\n\n<p>Perena is built on the premise that as stablecoins proliferate, liquidity could fragment, and stablecoins aren’t useful if they aren’t liquid. The platform offers a Solana-based stablecoin liquidity pool, and it plans to offer an <a href=\"https://x.com/SamBroner/status/1857072872205730283\">asset-backed</a> stablecoin in the future.</p>\n\n\n\n<p>The project was founded by Anna Yuan, who started the Solana Foundation’s stablecoin arm during her more than two years at the non-profit. While working at the foundation, Yuan began to see that new stablecoin issuers would mint a lot of tokens but would have limited integrations, and users consequently weren’t able to benefit from stablecoins in the real world.&nbsp;</p>\n\n\n\n<p>She cited Ondo as an example — the tokenized US Treasury stablecoin has over $100 million in supply but only 3,500 holders, <a href=\"https://solscan.io/token/A1KLoBrKBde8Ty9qtNQUtq3C2ortoC3u7twggz7sEto6\">according</a> to SolScan.</p>\n\n\n\n<p>I asked Yuan about the commonly cited claim in crypto that stablecoins have pulled off the difficult task of finding product-market fit, or satisfying the needs of an existing market.</p>\n\n\n\n<p>“I don’t agree,” Yuan said, adding that liquidity begets PMF, and most stablecoins simply aren’t liquid enough to be useful. She added that the real-world need for things like money transfers in emerging markets will help stablecoins “get there.”</p>\n\n\n\n<p>Perena is currently in closed beta, but the platform’s main feature will initially be a multi-stablecoin liquidity pool which uses a liquidity provider token called USD* that represents a piece of a seed pool containing Tether, Circle, and PayPal USD. In simpler terms, the liquidity pool model should make it easier to issue stablecoins, since smaller coins can access the liquidity from the well-capitalized seed pool.</p>\n\n\n\n<p>The concept has raised to-be-announced seed funds, and Yuan’s deep links in Solana helped her tap into the ecosystem’s very-active angel investor community. Yuan said she decided to start raising funds on a Thursday, and by late Friday, she already had a couple dozen angel investors on board. Solana co-founders Anatoly Yakovenko and Raj Gokal are both noteworthy backers.&nbsp;</p>\n\n\n\n<p>At the end of our call, Yuan and I got chatting about how Solana’s stablecoin market capitalization can meaningfully grow. The network currently accounts for just 2% of all stables, according to DeFiLlama.</p>\n\n\n\n<p>Yuan gave an interesting answer: Solana PayFi could grow the economy for people taking their paycheck in stablecoins. She estimated 2,000 people currently take their full-time salary in Solana stablecoins. That number could certainly get a lot bigger.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p><strong>Start your day with top crypto insights from David Canellis and Katherine Ross. <a href=\"https://blockworks.co/newsletter/empire\">Subscribe to the Empire newsletter</a>.</strong></p>\n\n\n\n<p><strong>Explore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. <a href=\"https://blockworks.co/newsletter/onthemargin\">Subscribe to the Forward Guidance newsletter</a>.</strong></p>\n\n\n\n<p><strong>Get alpha directly in your inbox with the <a href=\"https://blockworks.co/newsletter/research\">0xResearch newsletter</a> — market highlights, charts, degen trade ideas, governance updates, and more.</strong></p>\n\n\n\n<p><strong>The Lightspeed newsletter is all things Solana, in your inbox, every day. <a href=\"https://blockworks.co/newsletter/lightspeed\">Subscribe to daily Solana news</a> from Jack Kubinec and Jeff Albus.</strong></p>",
        "summary": "Perena is built on the premise that as stablecoins proliferate, liquidity could fragment, and stablecoins aren’t useful if they aren’t liquid",
        "ranking_score": 20
    },
    {
        "source": "Decrypt",
        "title": "BTC new ATH, SOL fee record, CHILLGUY hits $250M",
        "link": "https://decrypt.co/videos/interviews/93f92EPP/btc-new-ath-sol-fee-record-chillguy-hits-250m",
        "published": "7d ago",
        "content": "",
        "summary": "BTC hits new ATH of $93.5k. Blackrock BTC ETF options see $1.9bn volume. Grayscale to launch BTC ETF options. SOL fees hit one day record amid memecoin frenzy. Phantom flips Chrome on app store. Saylor to pitch BTC strategy to Microsoft board. Rumble stock rises as CEO teases BTC adoption. Robinhood is best deregulation trade: Bernstein. Trump considers crypto lawyer to lead SEC. Pro-crypto Lutnick to lead commerce dept. Sky deploys stablecoin USDS on Solana. Archax to offer tokenized money market funds. Bitfinex offers tokenized T-bills in El Salvador. Coinbase to delist WBTC. MiCA compliance ignites EUR crypto M&amp;A surge. South Korea to launch 20% crypto tax. Chainlink joins Brazil CBDC trade pilot. Injective launches AI agent platform.",
        "ranking_score": 20
    },
    {
        "source": "Decrypt",
        "title": "BTC pulls back to $87K, Hawkish Powell, MOODENG hits $650M",
        "link": "https://decrypt.co/videos/interviews/3omKCxQz/btc-pulls-back-to-87k-hawkish-powell-moodeng-hits-650m",
        "published": "12d ago",
        "content": "",
        "summary": "BTC briefly hits $87k amid ETF outflows. BTC ETFs get third highest outflow since launch. BTC miners moved $4bn BTC since Nov 12. Tump wants 0% capital gains tax on crypto. Lummis proposes selling gold to buy BTC. Pennsylvania introduces BTC reserve bill. Bhutan sold $100m BTC in last month. 18 US states and DeFi Lobby sue SEC over crypto. Gensler defends crypto stance amid exit rumours. XRP at 16 month high on Gensler exit rumours. Tether launches platform to simplify tokenization. Satoshi’s BTC holdings $100bn. Bitwise files to list crypto index ETP. Bitfinex hacker sentenced to 5 years in prison. Sling Money opens ‘global venmo’ to US users. Web4 will involve ‘crypto & AGI’. S. Korea to fine Upbit for KYC violations.",
        "ranking_score": 20
    },
    {
        "source": "Cryptotimes",
        "title": "Ripple To Invest in Bitwise's Rebranded XRP ETP Amid European Expansion",
        "link": "https://www.cryptotimes.io/2024/11/27/ripple-to-invest-in-bitwises-rebranded-xrp-etp/",
        "published": "3h ago",
        "content": "... <b>real</b>-<b>world asset</b> tokenization. Bitwise CEO Hunter Horsley emphasized ... The rebranding follows Bitwise&#39;s acquisition of ETC Group, a crypto investment&nbsp;...",
        "summary": null,
        "ranking_score": 15
    },
    {
        "source": "Bitcoinist",
        "title": "$0.10 Solana Competitor Predicted to Skyrocket to $15 and Secure a Top 20 Spot, Before ...",
        "link": "https://bitcoinist.com/0-10-solana-competitor-predicted-to-skyrocket-to-15-and-secure-a-top-20-spot-before-sol-touches-500/",
        "published": "4h ago",
        "content": "Rexas Finance is a <b>real</b>-<b>world asset</b> (RWA) tokenizing game-changer not just another token. Imagine with just a click owning a fraction of a Manhattan&nbsp;...",
        "summary": null,
        "ranking_score": 15
    },
    {
        "source": "Benzinga",
        "title": "$3 Trillion Opportunity: Infineo Chief Economist Discusses Blockchain And The Future Of ...",
        "link": "https://www.benzinga.com/24/11/42218767/the-3-trillion-opportunity-blockchain-and-the-future-of-life-insurance",
        "published": "4h ago",
        "content": "He also expressed optimism for regulatory clarity and predicted further integration of <b>real</b>-<b>world assets</b> onto the blockchain. Dr. Robert Murphy, the&nbsp;...",
        "summary": null,
        "ranking_score": 15
    },
    {
        "source": "Yahoo",
        "title": "Bitwise Rebrands XRP ETP; Ripple To Invest in Product",
        "link": "https://uk.finance.yahoo.com/news/bitwise-rebrands-xrp-etp-ripple-080300552.html",
        "published": "5h ago",
        "content": "XRP, the world&#39;s fifth-largest crypto <b>asset</b> at ... <b>real world</b> tokenization. The XRPL is known for ... Bitwise has seen significant growth in 2024,&nbsp;...",
        "summary": null,
        "ranking_score": 15
    },
    {
        "source": "Thecryptobasic",
        "title": "AI And DeFi Cryptos Lead The Charge In 2024: Top 5 Picks For Stunning ROI",
        "link": "https://thecryptobasic.com/2024/11/27/ai-and-defi-cryptos-lead-the-charge-in-2024-top-5-picks-for-stunning-roi/",
        "published": "4h ago",
        "content": "CYBRO Trending <b>RWA</b> Altcoins. As 2024 draws near, a new wave is sweeping through the crypto&nbsp;...",
        "summary": null,
        "ranking_score": 15
    },
    {
        "source": "Ledgerinsights",
        "title": "Deutsche Bank invests $20m in DLT payment infrastructure Partior",
        "link": "https://www.ledgerinsights.com/deutsche-bank-invests-20m-in-dlt-payment-infrastructure-partior/",
        "published": "5h ago",
        "content": "Other single bank <b>tokenized</b> deposit solutions enable their corporate treasury clients to move money around the world 24/7. But most large enterprise&nbsp;...",
        "summary": null,
        "ranking_score": 15
    },
    {
        "source": "Marktechpost",
        "title": "This AI Paper Introduces BEST-STD (Spoken Term Detection): A Novel Bidirectional Mamba ...",
        "link": "https://www.marktechpost.com/2024/11/27/this-ai-paper-introduces-best-std-spoken-term-detection-a-novel-bidirectional-mamba-enhanced-speech-tokenization-framework-for-efficient-spoken-term-detection/",
        "published": "5h ago",
        "content": "Researchers from the Indian Institute of Technology Kanpur and imec – Ghent University have introduced a novel speech <b>tokenization</b> framework named&nbsp;...",
        "summary": null,
        "ranking_score": 15
    },
    {
        "source": "Cryptoglobe",
        "title": "Ripple Invests in Bitwise's XRP ETP as Token Price Surge",
        "link": "https://www.cryptoglobe.com/latest/2024/11/ripple-invests-in-bitwises-xrp-etp-as-token-price-surge/",
        "published": "6h ago",
        "content": "These expanding use cases include cross-border remittances, decentralized finance applications, and <b>real</b>-<b>world asset</b> tokenization. The XRPL, it&nbsp;...",
        "summary": null,
        "ranking_score": 5
    },
    {
        "source": "Theafricalogistics",
        "title": "Riding the waves: Key trends shaping global stock markets",
        "link": "https://theafricalogistics.com/in-depth/riding-the-waves-key-trends-shaping-global-stock-markets/",
        "published": "7h ago",
        "content": "Tokenization of Assets. The tokenization of stocks and <b>real</b>-<b>world assets</b>, using blockchain technology, is another emerging trend. Tokenization&nbsp;...",
        "summary": null,
        "ranking_score": 5
    },
    {
        "source": "Cryptobriefing",
        "title": "Ripple backs Bitwise Physical XRP ETP following its rebranding",
        "link": "https://cryptobriefing.com/ripple-invests-in-xrp-etp/",
        "published": "7h ago",
        "content": "... <b>real world</b> tokenization. “XRP and the XRP Ledger are among the most ... <b>assets</b> that are resilient and have <b>real</b>-<b>world</b> utility.” Bitwise&nbsp;...",
        "summary": null,
        "ranking_score": 5
    },
    {
        "source": "Bravenewcoin",
        "title": "Turning $750 into $1500000: In 2021 It Was Shiba Inu, In 2023 Pepe Coin, Which Penny ...",
        "link": "https://bravenewcoin.com/insights/turning-750-into-1500000-in-2021-it-was-shiba-inu-in-2023-pepe-coin-which-penny-token-will-be-the-next",
        "published": "7h ago",
        "content": "... actual assets. ... Rexas Finance distinguishes itself from the sea of meme coins by emphasizing <b>real</b>-<b>world asset</b> tokenization, therefore orienting it&nbsp;...",
        "summary": null,
        "ranking_score": 5
    },
    {
        "source": "Bitcoinist",
        "title": "Top 10 Real-World-Asset Tokens to Buy in the 2024/25 Bull Run",
        "link": "https://bitcoinist.com/top-10-real-world-asset-tokens-to-buy-in-the-2024-25-bull-run/",
        "published": "7h ago",
        "content": "Tokenized RWAs are booking. As of November 2024, <b>real</b>-<b>world assets</b> constitute one of the fastest-growing sectors within decentralized finance,&nbsp;...",
        "summary": null,
        "ranking_score": 5
    },
    {
        "source": "Bravenewcoin",
        "title": "4 Altcoins That Could Repeat XRP's 2017 Bull Run",
        "link": "https://bravenewcoin.com/insights/4-altcoins-that-could-repeat-xrps-2017-bull-run",
        "published": "8h ago",
        "content": "By use of fractional ownership, the platform&#39;s emphasis on <b>real</b>-<b>world asset</b> (RWA) tokenization lets investors engage in historically illiquid sectors&nbsp;...",
        "summary": null,
        "ranking_score": 5
    },
    {
        "source": "Zawya",
        "title": "Magma opens new office in Dubai",
        "link": "https://www.zawya.com/en/press-release/companies-news/magma-opens-new-office-in-dubai-gn3uiiad",
        "published": "8h ago",
        "content": "... real estate management. Dubai, UAE – Magma, a <b>real</b>-<b>world assets</b> platform leveraging digital twin and blockchain technology for real estate&nbsp;...",
        "summary": null,
        "ranking_score": 5
    },
    {
        "source": "Tradingview",
        "title": "Ripple backs Bitwise Physical XRP ETP following its rebranding",
        "link": "https://www.tradingview.com/news/cryptobriefing:57f9323a9094b:0-ripple-backs-bitwise-physical-xrp-etp-following-its-rebranding/",
        "published": "8h ago",
        "content": "... <b>assets</b> that are resilient and have <b>real</b>-<b>world</b> utility.&quot; Bitwise, overseeing over $10 billion in <b>assets</b>, recently filed with the SEC to launch a&nbsp;...",
        "summary": null,
        "ranking_score": 5
    },
    {
        "source": "Co",
        "title": "Shiba Inu (SHIB) Bulls Charge as SHIB Accumulation Hints at a 200% Rally",
        "link": "https://cryptodaily.co.uk/2024/11/shiba-inu-shib-bulls-charge-as-shib-accumulation-hints-at-a-200-rally",
        "published": "8h ago",
        "content": "By allowing the tokenization of actual assets—including real ... <b>Real</b>-<b>World Asset</b> Tokenization: Investors of RXS can purchase, sell, and&nbsp;...",
        "summary": null,
        "ranking_score": 5
    },
    {
        "source": "Crypto-news-flash",
        "title": "Bitcoin and Ethereum Whales Dump Billions in a Month, but They are Secretly Buying this ...",
        "link": "https://www.crypto-news-flash.com/bitcoin-and-ethereum-whales-dump-billions-in-a-month-but-they-are-secretly-buying-this-rwa-altcoin-at-0-004/",
        "published": "6h ago",
        "content": "Ethereum (ETH) and Bitcoin (BTC) holders diversify their portfolios with the new PropiChain <b>RWA</b> altcoin, aiming for a 22403% rally from its&nbsp;...",
        "summary": null,
        "ranking_score": 5
    },
    {
        "source": "Analyticsinsight",
        "title": "Ripple (XRP) Gearing Up for a Bull Run: Will It be Anything Like 2017 After Trump's First Election?",
        "link": "https://www.analyticsinsight.net/cryptocurrency-analytics-insight/ripple-xrp-gearing-up-for-a-bull-run-will-it-be-anything-like-2017-after-trumps-first-election",
        "published": "7h ago",
        "content": "Rather, Rexas Finance (RXS), a project aiming at a $900 trillion market with its ambitious <b>RWA</b> tokenization approach, may provide the solution for&nbsp;...",
        "summary": null,
        "ranking_score": 5
    },
    {
        "source": "Ibtimes",
        "title": "New Use Cases Drive Activity In Onchain Economy, Institutions Locked In: Blockchain Report",
        "link": "https://www.ibtimes.com/new-use-cases-drive-activity-onchain-economy-institutions-locked-blockchain-report-3752843",
        "published": "10h ago",
        "content": "<b>RWA</b> Value Highlights Increased Institutional Participation. Real-world assets (<b>RWA</b>) have taken the financial world by storm, and it underscores the&nbsp;...",
        "summary": null,
        "ranking_score": 5
    },
    {
        "source": "Blockster",
        "title": "Emergence Unveils the New Worlds Initiative: A Playable Cinematic Universe Powered by $OMETA",
        "link": "https://blockster.com/emergence-unveils-the-new-worlds-initiative-a-playable-cinematic-universe-powered-by-ometa",
        "published": "15h ago",
        "content": "Singularity Finance Expands Ecosystem with Strategic Partnerships in AI and <b>RWA</b> Economy. November 22, 2024. 916 views &middot; People. Transak Joins Forces&nbsp;...",
        "summary": null,
        "ranking_score": 5
    },
    {
        "source": "Dimsumdaily",
        "title": "Archax and Ripple partner to launch tokenised money market fund on XRPL",
        "link": "https://www.dimsumdaily.hk/archax-and-ripple-partner-to-launch-tokenised-money-market-fund-on-xrpl/",
        "published": "8h ago",
        "content": "This collaboration enables <b>tokenised</b> access to Abrdn&#39;s U.S. dollar Liquidity Fund (Lux) valued at $4.8 billion (£3.8 billion), marking a significant&nbsp;...",
        "summary": null,
        "ranking_score": 5
    },
    {
        "source": "Blockchainreporter",
        "title": "Best Cryptos to Buy in November 2024: Whale Activity Reported in Qubetics Amid Polkadot ...",
        "link": "https://blockchainreporter.net/best-cryptos-to-buy-in-november-2024-whale-activity-reported-in-qubetics-amid-polkadot-rally-and-celestias-potential-price-rise/",
        "published": "13h ago",
        "content": "Qubetics ($TICS): Transforming Real-World Asset <b>Tokenisation</b>. Qubetics isn&#39;t just making noise; it&#39;s rewriting the crypto playbook. As the world&#39;s&nbsp;...",
        "summary": null,
        "ranking_score": 5
    },
    {
        "source": "Bitperfect",
        "title": "Major Breakthrough in Crypto World Revealed: Discover What's Now on the XRP Ledger!",
        "link": "https://bitperfect.pe/uk/major-breakthrough-in-crypto-world-revealed-discover-whats-now-on-the-xrp-ledger-2/",
        "published": "13h ago",
        "content": "In a groundbreaking move for the world of digital assets, Ripple has <b>tokenised</b> the £4.77 billion US dollar Liquidity Fund managed by abrdn.",
        "summary": null,
        "ranking_score": 5
    },
    {
        "source": "Lexology",
        "title": "The Payments Newsletter including Digital Assets & Blockchain, March 2024",
        "link": "https://www.lexology.com/library/detail.aspx%3Fg%3Da4ddb0fc-b866-4ae5-866d-b236d325fb27",
        "published": "17h ago",
        "content": "... <b>tokenised</b> funds to enable the adoption of asset <b>tokenisation</b> ... &#39;The Financial Stability Implications of <b>Tokenisation</b>&#39; report examines <b>tokenisation</b>&nbsp;...",
        "summary": null,
        "ranking_score": 5
    },
    {
        "source": "Co",
        "title": "Tokenised wine investment makes a debut",
        "link": "https://www.moneyweb.co.za/moneyweb-crypto/crypto-podcasts/tokenised-wine-investment-makes-a-debut/",
        "published": "20h ago",
        "content": "Meza Wines has broken new ground with its <b>tokenised</b> wine investment built on the blockchain. Fine wine investments have historically beaten&nbsp;...",
        "summary": null,
        "ranking_score": 5
    },
    {
        "source": "Bitcoinist",
        "title": "This Token Looks Like Dogecoin (DOGE) in 2021, Primed for a Sharp Price Spike to $18 from $0.09",
        "link": "https://bitcoinist.com/this-token-looks-like-dogecoin-doge-in-2021-primed-for-a-sharp-price-spike-to-18-from-0-09/",
        "published": "6h ago",
        "content": "Rexas Finance is developing itself as a game-changing platform. Fundamentally, Rexas Finance enables people and companies to <b>tokenize</b> real-world&nbsp;...",
        "summary": null,
        "ranking_score": 5
    },
    {
        "source": "Theprint",
        "title": "Rexas Finance Presale Demand Exceeds Expectations, Stage 7 Ends Weeks Ahead of Schedule",
        "link": "https://theprint.in/brandstand/adon/rexas-finance-presale-demand-exceeds-expectations-stage-7-ends-weeks-ahead-of-schedule/2376988/",
        "published": "7h ago",
        "content": "With <b>tokenization</b>, investors from any part of the world can own portions of properties, diversifying their portfolios without requiring significant&nbsp;...",
        "summary": null,
        "ranking_score": 5
    },
    {
        "source": "Timesnownews",
        "title": "Rexas Finance Crypto Price Prediction: RXS Will Hit $50 with Ease, Here's the Timeline",
        "link": "https://www.timesnownews.com/bizz-impact/rexas-finance-crypto-price-prediction-rxs-will-hit-50-with-ease-heres-the-timeline-article-115704828",
        "published": "8h ago",
        "content": "Rexas Finance (RXS) distinguishes itself with its goal of providing efficient and real-world asset <b>tokenizing</b> access. , Bizz Impact News - Times&nbsp;...",
        "summary": null,
        "ranking_score": 5
    },
    {
        "source": "Analyticsinsight",
        "title": "Is Cardano (ADA) in a Bull Run? Why $1.78 Could Be the Next Price Target",
        "link": "https://www.analyticsinsight.net/cryptocurrency-analytics-insight/is-cardano-ada-in-a-bull-run-why-178-could-be-the-next-price-target",
        "published": "8h ago",
        "content": "Discover Cardano&#39;s (ADA) bullish momentum targeting $1.78 and Rexas Finance&#39;s (RXS) groundbreaking RWA <b>tokenization</b> model, set to deliver up to&nbsp;...",
        "summary": null,
        "ranking_score": 5
    },
    {
        "source": "Bitcoinist",
        "title": "8 Altcoins That Will Potentially Make You Very Wealthy in the Next 8 Weeks",
        "link": "https://bitcoinist.com/8-altcoins-that-will-potentially-make-you-very-wealthy-in-the-next-8-weeks/",
        "published": "8h ago",
        "content": "Rexas Finance (RXS) is implementing revolutionary asset <b>tokenization</b> across the blockchain. With its price at $0.10 in the eighth presale stage, RXS&nbsp;...",
        "summary": null,
        "ranking_score": 5
    },
    {
        "source": "Pymnts",
        "title": "Digital Identities, Wallets and Tokens Give Consumers Passports to Commerce",
        "link": "https://www.pymnts.com/mobile-wallets/2024/digital-identities-wallets-tokens-give-consumers-passport-commerce/",
        "published": "19h ago",
        "content": "... <b>tokenized</b>, are next most popular, at 63%. About 97% of payment service ... <b>tokenization</b>, <b>Tokenization</b> Innovation Report, Visa, Visa Payment Passkey&nbsp;...",
        "summary": null,
        "ranking_score": 5
    },
    {
        "source": "CoinDesk",
        "title": "XRP Rally Sees Record Profit-Taking as Ripple Labs Plans to Invest in Bitwise XRP ETF",
        "link": "https://www.coindesk.com/markets/2024/11/27/xrp-rally-sees-record-profit-taking-as-ripple-labs-plans-to-invest-in-bitwise-xrp-etf",
        "published": "10h ago",
        "content": "<p>Long-term holders of XRP realized over $1.5 billion in profits last week as the payments-focused cryptocurrency zoomed to a three-year high, &lt;a href=&quot;https://www.fxstreet.com/cryptocurrencies/news/ripple-donates-25-million-to-crypto-super-pac-again-amid-record-profit-taking-levels-among-xrp-investors-202411262145&quot; target=&quot;_blank&quot;&gt;data shows&lt;/a&gt;, marking the highest profit realization since April 2021.\n\nProfit-taking is usual investor behavior after rallies and doesn’t indicate a change in the long-term sentiment for any token.\n\nThe Market Value to Realized Value (MVRV) ratio surged to 217% on Tuesday, according to an &lt;a href=&quot;https://www.fxstreet.com/cryptocurrencies/news/ripple-donates-25-million-to-crypto-super-pac-again-amid-record-profit-taking-levels-among-xrp-investors-202411262145&quot; target=&quot;_blank&quot;&gt;FXStreet report&lt;/a&gt; citing Santiment data, suggesting that the current market valuation of XRP is significantly higher than its average purchase price — indicative of potential overvaluation in the short term in a move that may dampen a swift rally higher.\n</p><p>MVRV is a ratio of the total value of all the coins in circulation by the total value of all coins based on the price at which they were last moved on the blockchain. It can be thought of as the aggregate cost basis of all coins currently in circulation.\n</p><p>High profit-taking combined with the overvaluation signaled by the MVRV could lead to a market correction.\n</p><p>Several factors have helped catapult XRP prices recently, surging to a local high of $1.60 last week before paring gains to as low as $1.30. The token is still up 31% over the past week. \n</p><p>It has more than doubled in two weeks on several positive catalysts, such as the clearing of &lt;a href=&quot;https://www.coindesk.com/markets/2024/11/22/xrp-price-surges-25-as-headwinds-for-ripple-clear-even-more/&quot; target=&quot;_blank&quot;&gt;regulatory headwinds&lt;/a&gt; for closely related Ripple Labs, the &lt;a href=&quot;https://www.coindesk.com/markets/2024/11/26/xrp-holds-strong-as-archax-unveils-tokenized-money-market-fund-on-xrp-ledger&quot; target=&quot;_blank&quot;&gt;launch of money market&lt;/a&gt; funds on XRP Ledger, and a &lt;a href=&quot;https://www.coindesk.com/markets/2024/11/15/xrp-jumps-17-outperforms-rest-of-the-market-as-rally-cools-trader-thinks-120k-bitcoin-target-still-in-play/&quot; target=&quot;_blank&quot;&gt;technical bullish price analysis&lt;/a&gt;.\n</p><p>Meanwhile, Ripple plans to invest an unspecified amount in the newly rebranded Bitwise Physical XRP ETP (earlier called the ETC Group Physical XRP), per a Wednesday release. The announcement sent XRP higher by 10%.\n</p><p>The European XRP ETP will now trade under the GXRP ticker on Germany’s Deutsche Börse XETRA, the &lt;a href=&quot;https://t.co/9pHWU8YN4n&quot; target=&quot;_blank&quot;&gt;release said&lt;/a&gt;.\n</p><p>“Global demand for exposure to the crypto asset class has exploded in 2024, fueled by a growing interest in crypto-backed investment offerings,” Brad Garlinghouse, CEO at Ripple Labs, said in the release. “With the U.S. regulatory environment for crypto finally becoming more clear, this trend is poised to accelerate, further driving demand for crypto ETPs, such as the Bitwise Physical XRP ETP.”\n</p><p>The 100% physically backed ETP launched by Bitwise in 2022 allows European investors to gain exposure to XRP.</p>",
        "summary": "Content",
        "ranking_score": 5
    },
    {
        "source": "Techpoint",
        "title": "Top 3 Cryptocurrencies to Watch in 2024: Ethereum, Solana, and Qubetics",
        "link": "https://techpoint.africa/2024/11/26/top-3-cryptocurrencies-to-watch-in-2024-ethereum-solana-and-qubetics/",
        "published": "1d ago",
        "content": "... <b>tokenisation</b>, these platforms are shaping the future of blockchain technology. ... Qubetics is setting itself apart by focusing on asset <b>tokenisation</b>&nbsp;...",
        "summary": null,
        "ranking_score": 0
    },
    {
        "source": "Finextra",
        "title": "How Finance Can be a Conduit for Environmental Health",
        "link": "https://www.finextra.com/videoarticle/3209/how-finance-can-be-a-conduit-for-environmental-health",
        "published": "1d ago",
        "content": "<b>Tokenisation</b> use cases to be excited about &middot; /sibos &middot; <b>Tokenisation</b> use cases to be excited about. 24 October 2024. Can Every Product Be Climate&nbsp;...",
        "summary": null,
        "ranking_score": 0
    },
    {
        "source": "BlockWorks",
        "title": "Why analysts are upping price targets for MSTR and COIN",
        "link": "https://blockworks.co/news/mstr-coin-price-targets",
        "published": "unknown time",
        "content": "<p><br /><em>This is a segment from the Forward Guidance newsletter. To read full editions, </em><a href=\"https://blockworks.co/newsletter/forwardguidance\"><em>subscribe</em></a><em>.</em></p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p>As more investors seem to be seeking exposure to the crypto asset class (particularly after <a href=\"https://blockworks.co/news/crypto-impacts-since-election-outcome\">Trump’s election win</a>), stocks are one way to get involved.&nbsp;</p>\n\n\n\n<p>Let’s check in on that ecosystem.&nbsp;</p>\n\n\n\n<p>Starting with MicroStrategy, Benchmark’s Mark Palmer on Nov. 18 raised his price target for MSTR shares from $300 to $450. He’s revising that again, according to a Monday note — this time to $650.</p>\n\n\n\n<p>This comes after MicroStrategy last week completed a $3 billion offering of convertible senior notes. It then revealed in a Monday filing that it bought <a href=\"https://blockworks.co/news/btc-100k-microstrategy-buy\">55,500 BTC</a> from Nov. 18 to Nov. 24 for $5.4 billion in cash (averaging $97,862 each).&nbsp;</p>\n\n\n\n<p>MSTR shares hovered around $402 at 2 pm ET Monday — down 4.7% on the day but up 70% from a month ago.</p>\n\n\n\n<p>The strength of the MSTR rally has some <a href=\"https://seekingalpha.com/article/4739669-microstrategy-paying-245000-per-bitcoin-makes-no-sense-mstr-stock\">questioning</a> the idea that these shares should trade at a nearly 3x premium to the market value of the company’s BTC pile.&nbsp;</p>\n\n\n\n<p>But MicroStrategy, via treasury operations, has generated ~79,130 bitcoins YTD, translating into a 41.8% BTC yield (the % change of the ratio between MSTR’s bitcoin holdings and its fully diluted share count), Palmer explained. That BTC is currently worth roughly $7.5 billion.</p>\n\n\n\n<p>“We regard the dollar values of the bitcoins that MSTR creates, calculated by using its BTC yield, as analogous to earnings, and we believe they can be projected and contextualized through the attachment of a valuation multiple,” he said.</p>\n\n\n\n<p>On to Coinbase, Oppenheimer analysts on Monday raised their COIN price target from $265 to $358. The stock was trading around $311 at 2 pm ET Monday.&nbsp;</p>\n\n\n\n<p>They mention that the “chilling effect” created by SEC lawsuits against “widely perceived good actors” in the segment, like Coinbase, “can’t be understated.”</p>\n\n\n\n<p>“It had deterred new capital going into this space, and many developers had pivoted to other industries,” they added. “But the industry has a chance to rebuild the reputation, and Coinbase is leading this new chapter.”</p>\n\n\n\n<p>In addition to the expectation of a <a href=\"https://blockworks.co/news/gary-gensler-resigning\">yet-to-be-named</a> new SEC chair embracing crypto as a catalyst, Coinbase’s trading volumes have increased substantially since the US election.&nbsp;&nbsp;&nbsp;</p>\n\n\n\n<p>Average daily volumes have risen to $6.5 billion since Election Day — higher than the $2.4 billion YTD average prior to Nov. 5. Oppenheimer is projecting Q4 spot trading volume to be $350 billion (would be up 89% quarter over quarter and 127% year over year) and for “high trading volume to sustain under <a href=\"https://blockworks.co/news/revisiting-trumps-crypto-promises-after-his-election-win\">Trump’s crypto policy</a>.”</p>\n\n\n\n<p>As for other crypto stocks, Compass Point analyst Joe Flynn increased Galaxy’s price target from $22 (CAD) to $33 (~$24 CAD on Monday afternoon).&nbsp;</p>\n\n\n\n<p>Beyond higher crypto prices and trading volumes momentum, GLXY is set to benefit from its expected uplisting to the Nasdaq and its term sheet with a hyperscaler to host high-performance computing (HPC) at its Helios campus — a datacenter Flynn called an “underappreciated asset.”</p>\n\n\n\n<p>Flynn, also last week, lowered its rating of bitcoin miner Marathon Digital’s stock to neutral. He noted that “while MARA is an outsized beneficiary of higher BTC prices due to its HODL strategy, we don’t see much additional upside from the base business itself.”</p>\n\n\n\n<p>Then there’s competing miner Core Scientific (CORZ), which notably <a href=\"https://blockworks.co/news/core-scientific-rejects-coreweave-buyout-bid-after-big-hpc-deal\">offers HPC hosting</a> to cloud provider CoreWeave. Flynn wrote earlier this month that CORZ is “well positioned to continue expanding their existing lead in delivering application specific HPC/GPU datacenters with a single tenant focus.”&nbsp;</p>\n\n\n\n<p>CORZ is the top holding in the Amplify Transformational Data Sharing ETF (BLOK) — the largest blockchain-focused equity ETF. Other stocks in the top five are COIN, MSTR, Hut 8 Mining and GLXY.</p>\n\n\n\n<p>Dan Weiskopf, who co-manages BLOK’s portfolio, said it’s hard to value blockchain-fueled disruption over the next decade as regulations become more crypto-friendly.</p>\n\n\n\n<p>He told me: “The real excitement should be around the adoption of tokenization as the application and how blockchain as the technology will <a href=\"https://blockworks.co/news/investor-appetite-for-tokenized-funds\">soon transform</a> industries across the board.”</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p><strong>Start your day with top crypto insights from David Canellis and Katherine Ross. <a href=\"https://blockworks.co/newsletter/empire\">Subscribe to the Empire newsletter</a>.</strong></p>\n\n\n\n<p><strong>Explore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. <a href=\"https://blockworks.co/newsletter/onthemargin\">Subscribe to the Forward Guidance newsletter</a>.</strong></p>\n\n\n\n<p><strong>Get alpha directly in your inbox with the <a href=\"https://blockworks.co/newsletter/research\">0xResearch newsletter</a> — market highlights, charts, degen trade ideas, governance updates, and more.</strong></p>\n\n\n\n<p><strong>The Lightspeed newsletter is all things Solana, in your inbox, every day. <a href=\"https://blockworks.co/newsletter/lightspeed\">Subscribe to daily Solana news</a> from Jack Kubinec and Jeff Albus.</strong></p>",
        "summary": "MSTR shares hovered around $402 at 2 pm ET Monday — down 4.7% on the day but up 70% from a month ago",
        "ranking_score": 0
    },
    {
        "source": "BlockWorks",
        "title": "Web3 Watch: FIFA officially licenses blockchain-based mobile game",
        "link": "https://blockworks.co/news/fifa-blockchain-mobile-game",
        "published": "unknown time",
        "content": "<p>FIFA and Mythical Games are collaborating to launch FIFA Rivals, the companies announced on Friday. The app is an officially licensed, free-to-play soccer game for iOS and Android.</p>\n\n\n\n<figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"><div class=\"wp-block-embed__wrapper\">\n<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">New title in the 'Rivals' franchise!<br /><br />Introducing <a href=\"https://twitter.com/FIFARivals?ref_src=twsrc%5Etfw\">@FIFARivals</a>, an officially licensed mobile game from <a href=\"https://twitter.com/playmythical?ref_src=twsrc%5Etfw\">@playmythical</a> and <a href=\"https://twitter.com/FIFAcom?ref_src=twsrc%5Etfw\">@FIFAcom</a> ⚽<br /><br />Powered by Mythos chain, build your dream team, own your players, and compete in real-time arcade action.<br /><br />Available in 2025 on iOS &amp; Android. <a href=\"https://t.co/2S5EnhV3sB\">pic.twitter.com/2S5EnhV3sB</a></p>— Enter the Mythos (@EnterTheMythos) <a href=\"https://twitter.com/EnterTheMythos/status/1859963926672486879?ref_src=twsrc%5Etfw\">November 22, 2024</a></blockquote>\n</div></figure>\n\n\n\n<p>Scheduled for a 2025 release, players will be able to manage their own football clubs and compete against other players in real-time arcade gameplay.</p>\n\n\n\n<p>FIFA Rivals will include an in-game marketplace for players to trade football stars as NFT-collectibles on the Mythos blockchain.</p>\n\n\n\n<p><strong>Read more: </strong><a href=\"https://blockworks.co/news/off-the-grid-blockchain-gaming-experience\">Off the Grid’s popularity is about ‘best of breed technologies’&nbsp;</a></p>\n\n\n\n<p>“Our goal (with FIFA Rivals) is to replicate our success with previous Rivals games and set new benchmarks in the Web3 gaming sector,” said John Linden, CEO and founder of Mythical Games.&nbsp;</p>\n\n\n\n<p>Mythical Games is the Web3 <a href=\"https://blockworks.co/tag/gaming\">gaming</a> studio behind the NFL Rivals game that today boasts over six million downloads. Similar to FIFA Rivals, players in NFL Rivals can own and trade NFT-collectible player cards via the Mythical Marketplace on Mythos.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Suntory Group tokenizes Premium Malt’s beer on Avalanche</h2>\n\n\n\n<p>Global beverage corporation Suntory Group announced Tuesday a pilot project to tokenize its signature Japanese Premium Malt’s bottled beer on the <a href=\"https://blockworks.co/tag/avalanche\">Avalanche</a> blockchain.</p>\n\n\n\n<p><strong>Read more: </strong><a href=\"https://blockworks.co/news/lightspeed-newsletter-solana-wine-tokenization\">Wine tokenization on Solana</a></p>\n\n\n\n<p>As part of a strategic partnership with Ava Labs, this limited release of tokenized Premium Malt’s bottles will be open to Japanese markets on Nov. 12.</p>\n\n\n\n<p>Premium Malt’s beer bottles will come with a near-field communication (NFC) tag which, when opened and scanned, will enable the collection of a unique <a href=\"https://blockworks.co/tag/nfts\">NFT</a> for consumers.</p>\n\n\n\n<p>The announcement was made at Thailand Blockchain Week by Suntory Chief Digital Innovation Officer Rio “Popeye” Inaba, and Ava Labs’ Japan head, Roi Hirata.</p>\n\n\n\n<h2 class=\"wp-block-heading\">One interesting stat:</h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Monkey Tilt, a crypto-based gambling platform, announced on Wednesday a $30 million Series A funding round led by Pantera Capital. The sum brings its total funding raised to over $50 million.</li>\n</ul>\n\n\n\n<h2 class=\"wp-block-heading\">Also of note:</h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Season 2 of Yuga Labs’ multiplayer <a href=\"https://blockworks.co/news/yuga-labs-demos-otherside-metaverse\">metaverse project</a> “Project Dragon” is <a href=\"https://x.com/OthersideMeta/status/1857477347500273689\">launching</a> today with new avatars and rules for its virtual world game.</li>\n\n\n\n<li>Chiliz Group is set to <a href=\"https://x.com/Chiliz/status/1858471882368119070\">launch</a> a non-custodial Socios.com wallet for its 2.3 million users.&nbsp;</li>\n\n\n\n<li>The Toledo Museum of Art <a href=\"https://x.com/yatreda/status/1858609798889009356\">purchased</a> the digital artwork “Abyssinian Queen” by Ethiopian art collective Yatreda, using USDC on the Ethereum blockchain.</li>\n</ul>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p><strong>Start your day with top crypto insights from David Canellis and Katherine Ross. <a href=\"https://blockworks.co/newsletter/empire\">Subscribe to the Empire newsletter</a>.</strong></p>\n\n\n\n<p><strong>Explore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. <a href=\"https://blockworks.co/newsletter/onthemargin\">Subscribe to the Forward Guidance newsletter</a>.</strong></p>\n\n\n\n<p><strong>Get alpha directly in your inbox with the <a href=\"https://blockworks.co/newsletter/research\">0xResearch newsletter</a> — market highlights, charts, degen trade ideas, governance updates, and more.</strong></p>\n\n\n\n<p><strong>The Lightspeed newsletter is all things Solana, in your inbox, every day. <a href=\"https://blockworks.co/newsletter/lightspeed\">Subscribe to daily Solana news</a> from Jack Kubinec and Jeff Albus.</strong></p>",
        "summary": "Plus, Suntory Group tokenizes Premium Malt’s beer on Avalanche",
        "ranking_score": 0
    }
]