[
    {
        "source": "CoinDesk",
        "title": "Stablecoins Hit Record $190B Market Cap, Surpassing Pre-Terra Crash Peak: CCData",
        "link": "https://www.coindesk.com/markets/2024/11/27/stablecoins-hit-record-190-b-market-cap-surpassing-pre-terra-crash-peak-cc-data",
        "published": "2024-11-27T13:04:40Z",
        "summary": "<p>Stablecoin market capitalization rose to $190 billion this month, surpassing the pre-crypto winter peak of April 2022, CCData reported.</p><p>The crypto rally this year and particularly since the U.S. presidential election fueled demand for stablecoins, which are widely used for trading. </p><p>The emergence of novel tokenized investment products with fixed prices such as BlackRock's BUIDL and Ethena's USDe also helped growth for the sector.</p><p>Tether's USDT supply rose 10% over the last month to a new peak of $132 billion, while Circle's USDC grew 12% to almost $39 billion, the report said.</p>",
        "content": "<p>Following <a href=\"https://www.coindesk.com/markets/2024/11/22/bitcoin-nears-100k-with-crypto-market-cap-at-record-34t/\" target=\"_blank\">bitcoin</a> (<a href=\"https://www.coindesk.com/price/bitcoin\" target=\"_blank\">BTC</a>) and <a href=\"https://www.coindesk.com/markets/2024/11/22/solanas-sol-surges-to-record-high-above-260\" target=\"_blank\">solana</a> (<a href=\"https://www.coindesk.com/price/solana\" target=\"_blank\">SOL</a>) reaching all-time high prices earlier this month, the stablecoin sector has now joined crypto's record-breaking streak.</p><p>The combined market size of stablecoins hit $190 billion this month for the first time ever, Wednesday's <a href=\"https://ccdata.io/reports/stablecoins-cbdcs-report-november-2024\" target=\"_blank\">report</a> by digital asset analytics firm CCData noted. CCData is owned by Bullish, CoinDesk's parent company. The previous peak of $188 billion was recorded in April 2022, just before the cataclysmic implosion of the <a href=\"https://www.coindesk.com/learn/the-fall-of-terra-a-timeline-of-the-meteoric-rise-and-crash-of-ust-and-luna/\" target=\"_blank\">Terra-Luna stablecoin</a> that added fuel to the digital asset bear market now referred to as crypto winter.</p><p><a href=\"https://www.coindesk.com/markets/2024/11/12/stablecoin-supply-expands-by-5b-since-us-election-as-investors-pile-into-crypto\" target=\"_blank\">Demand for stablecoins</a> soared as cryptocurrency prices exploded in November as investors rushed into crypto, expecting that the U.S. government will be friendlier toward the industry following Donald Trump's election victory. Stablecoins are a key piece of plumbing in the crypto ecosystem. With their prices anchored to an external asset, predominantly the U.S. dollar, they are a popular source of liquidity for crypto trading, serving as dry powder on exchanges.</p><p>Read more: <a href=\"https://www.coindesk.com/business/2024/09/12/stablecoins-increasingly-used-for-savings-payments-in-emerging-countries-but-crypto-trading-still-leads-report\" target=\"_blank\">Stablecoins Increasingly Used for Savings, Payments in Emerging Countries, but Crypto Trading Still Leads</a></p><p>This year also brought an explosion of novel tokenized products with prices also pegged to $1, including tokenized money market funds like BlackRock's BUIDL and investment strategies wrapped into a token like Ethena's \"synthetic dollar\" USDe, which is backed by a crypto carry trade. The CCData report included these platforms in the tally.</p><p>Tether's <a href=\"https://www.coindesk.com/price/tether\" target=\"_blank\">USDT</a> continues to dominate the stablecoin sector. The token's market cap rose 10% over the past month to a new peak of $132 billion, CCData noted. Meanwhile, Circle's <a href=\"https://www.coindesk.com/price/usd-coin\" target=\"_blank\">USDC</a>, grew 12% to a nearly $39 billion market cap, the highest since the March 2023 regional banking crisis that <a href=\"https://www.coindesk.com/markets/2023/03/11/usdc-stablecoin-and-crypto-market-go-haywire-after-silicon-valley-bank-collapses\" target=\"_blank\">heavily impacted</a> the token. USDT claims a 69.9% market share currently, while USDC is second-largest with a 20.5% share.</p><p>It was not just the top two that saw rapid growth: 38 of the nearly 200 tokens tracked made a new all-time high supply over the past month, CCData said.</p><img alt=\"\" src=\"https://cdn.sanity.io/images/s3y3vcno/production/1b8c6f3a5c3ff4f229f3903007988134fab434d7-2196x706.png\" /><p>Ethena's USDe, for example, saw a 42% increase to a new record of $3.8 billion in November. The token generates yield to investors by holding spot BTC and ETH and simultaneously shorting (selling) an equal amount of perpetual futures farming the funding rate. Ethena <a href=\"https://app.ethena.fi/\" target=\"_blank\">now</a> offers 25% annualized yield (APY) to token holders, as frothy crypto markets elevated funding rates, <a href=\"https://www.coindesk.com/markets/2024/11/19/ethena-sees-1b-inflows-as-crypto-rally-brings-back-double-digit-yields\" target=\"_blank\">benefitting the protocol</a>.</p><p>The broad-market crypto rally also boosted trading volumes with stablecoin pairs on centralized exchanges, rising 77% month-over-month to $1.8 trillion, the report said. USDT was responsible for about 83% of the volumes, followed by Hong Kong-based First Digital's <a href=\"https://www.coindesk.com/markets/2023/06/01/first-digital-unveils-usd-stablecoin-as-hong-kong-crypto-rules-kick-in\" target=\"_blank\">FDUSD</a> 9% and USDC's 8% share.</p>",
        "categories": [
            "Markets",
            "Stablecoins",
            "Tether",
            "USDT",
            "Circle",
            "USDC",
            "Ethena",
            "Ccdata"
        ]
    },
    {
        "source": "CoinDesk",
        "title": "XRP Rally Sees Record Profit-Taking as Ripple Labs Plans to Invest in Bitwise XRP ETF",
        "link": "https://www.coindesk.com/markets/2024/11/27/xrp-rally-sees-record-profit-taking-as-ripple-labs-plans-to-invest-in-bitwise-xrp-etf",
        "published": "2024-11-27T11:40:32Z",
        "summary": "<p>The Market Value to Realized Value (MVRV) ratio surged to 217% on Tuesday, showing overbrought market activity.</p><p>High profit-taking and an MVRV ratio indicating overvaluation could lead to a market correction.</p><p>Ripple plans to invest an unspecified amount in the newly rebranded Bitwise Physical XRP ETP (earlier called the ETC Group Physical XRP).</p>",
        "content": "<p>Long-term holders of XRP realized over $1.5 billion in profits last week as the payments-focused cryptocurrency zoomed to a three-year high, <a href=\"https://www.fxstreet.com/cryptocurrencies/news/ripple-donates-25-million-to-crypto-super-pac-again-amid-record-profit-taking-levels-among-xrp-investors-202411262145\" target=\"_blank\">data shows</a>, marking the highest profit realization since April 2021.\n\nProfit-taking is usual investor behavior after rallies and doesn’t indicate a change in the long-term sentiment for any token.\n\nThe Market Value to Realized Value (MVRV) ratio surged to 217% on Tuesday, according to an <a href=\"https://www.fxstreet.com/cryptocurrencies/news/ripple-donates-25-million-to-crypto-super-pac-again-amid-record-profit-taking-levels-among-xrp-investors-202411262145\" target=\"_blank\">FXStreet report</a> citing Santiment data, suggesting that the current market valuation of XRP is significantly higher than its average purchase price — indicative of potential overvaluation in the short term in a move that may dampen a swift rally higher.\n</p><p>MVRV is a ratio of the total value of all the coins in circulation by the total value of all coins based on the price at which they were last moved on the blockchain. It can be thought of as the aggregate cost basis of all coins currently in circulation.\n</p><p>High profit-taking combined with the overvaluation signaled by the MVRV could lead to a market correction.\n</p><p>Several factors have helped catapult XRP prices recently, surging to a local high of $1.60 last week before paring gains to as low as $1.30. The token is still up 31% over the past week. \n</p><p>It has more than doubled in two weeks on several positive catalysts, such as the clearing of <a href=\"https://www.coindesk.com/markets/2024/11/22/xrp-price-surges-25-as-headwinds-for-ripple-clear-even-more/\" target=\"_blank\">regulatory headwinds</a> for closely related Ripple Labs, the <a href=\"https://www.coindesk.com/markets/2024/11/26/xrp-holds-strong-as-archax-unveils-tokenized-money-market-fund-on-xrp-ledger\" target=\"_blank\">launch of money market</a> funds on XRP Ledger, and a <a href=\"https://www.coindesk.com/markets/2024/11/15/xrp-jumps-17-outperforms-rest-of-the-market-as-rally-cools-trader-thinks-120k-bitcoin-target-still-in-play/\" target=\"_blank\">technical bullish price analysis</a>.\n</p><p>Meanwhile, Ripple plans to invest an unspecified amount in the newly rebranded Bitwise Physical XRP ETP (earlier called the ETC Group Physical XRP), per a Wednesday release. The announcement sent XRP higher by 10%.\n</p><p>The European XRP ETP will now trade under the GXRP ticker on Germany’s Deutsche Börse XETRA, the <a href=\"https://t.co/9pHWU8YN4n\" target=\"_blank\">release said</a>.\n</p><p>“Global demand for exposure to the crypto asset class has exploded in 2024, fueled by a growing interest in crypto-backed investment offerings,” Brad Garlinghouse, CEO at Ripple Labs, said in the release. “With the U.S. regulatory environment for crypto finally becoming more clear, this trend is poised to accelerate, further driving demand for crypto ETPs, such as the Bitwise Physical XRP ETP.”\n</p><p>The 100% physically backed ETP launched by Bitwise in 2022 allows European investors to gain exposure to XRP.</p>",
        "categories": [
            "Markets"
        ]
    },
    {
        "source": "CoinDesk",
        "title": "XRP Holds Strong as Archax Unveils Tokenized Money Market Fund on XRP Ledger",
        "link": "https://www.coindesk.com/markets/2024/11/26/xrp-holds-strong-as-archax-unveils-tokenized-money-market-fund-on-xrp-ledger",
        "published": "2024-11-26T07:46:26Z",
        "summary": "<p>Archax has provided access to Abrdn’s U.S. dollar Liquidity Fund (Lux) in tokenized form on XRPL.</p><p>Ripple will allocate $5 million into tokens on Abrdn’s Lux fund, part of a larger allocation to real-world assets (RWAs) on the XRPL.</p><p>XRP price jumped 6%, touching a high of $1.49 in the hours following the release, before paring gains in a market-wide drop.</p>",
        "content": "<p>XRP outperformed bitcoin (BTC) and other major tokens in the past 24 hours as regulated crypto broker and custodian Archax <a href=\"https://x.com/Ripple/status/1860995969375990069\" target=\"_blank\">unveiled a money market fund</a> on the XRP Ledger, a first for the network, in collaboration with closely related Ripple Labs and Abrdn.\n\nArchax has provided access to Abrdn’s U.S. dollar Liquidity Fund (Lux) in tokenized form on XRPL. Ripple will allocate $5 million worth of tokens into Abrdn’s Lux fund, part of a larger allocation to real-world assets (RWAs) on the XRPL.\n\nXRP price jumped 6%, touching a high of $1.49 in the hours following the release, before paring gains in a market-wide drop. The token is up 27% over the past week and more than has more than doubled in two weeks on several positive catalysts.\n\nReal World Assets (RWAs) are tangible or financial assets like real estate, commodities, or bonds that exist outside of the digital realm but can be represented as tokens on a blockchain. This process, known as tokenization, allows for fractional ownership, increased liquidity, and easier transfer of these assets.\n\nA money market involves trading short-term, high-quality debt instruments like Treasury bills, commercial paper, and certificates of deposit. It's where large institutions manage their short-term cash needs.\n\nArchax has been using Ripple’s digital assets custody since 2022. Lux has over $3.8 billion in assets under management, per a release.\n\nThe launch of the tokenized money market fund on the XRPL is a further boost to the growth of real-world asset tokenization, a sector that some eye as one of the hottest in crypto.\n\nIn a July report, global consulting firm McKinsey & Company expects the tokenized asset market to reach $4 trillion in an optimistic scenario by 2030. Boston Consulting Group and 21Shares have forecasted over $10 trillion of tokenized assets by the decade's end in their optimistic scenarios, as CoinDesk <a href=\"https://www.coindesk.com/markets/2024/06/21/mckinsey-sees-just-2t-of-tokenized-rwas-by-2030-in-base-case-with-broad-adoption-still-far-away\" target=\"_blank\">previously reported</a>.</p>",
        "categories": [
            "Markets",
            "Ripple",
            "XRP"
        ]
    },
    {
        "source": "CoinDesk",
        "title": "Why Memecoins Matter",
        "link": "https://www.coindesk.com/opinion/2024/11/25/why-memecoins-matter",
        "published": "2024-11-25T21:33:28Z",
        "summary": "Collage of memecoin project imagery",
        "content": "<p>Memecoins are the most divisive topic in crypto.</p><p></p><p>By memecoins, I mean tokens that represent an idea and fluctuate in price based on the attention that idea receives. The best meme investors tend to be young people who are very online and attuned to internet culture. Memecoins are commonly juxtaposed with tokens that possess actual utility within protocols, or so-called utility tokens.</p><p></p><p>Even with market caps surging and retail interest growing, most people tend to describe them as “stupid,” “degenerate,” or a “casino.” This includes the vast majority of crypto VCs, perhaps because their investment mandates tend to exclude memecoins (which can be lucrative) from their list of eligible investments. And just this week, many were calling for the complete government ban of the most popular memecoin launchpad, pump.fun, due to lax content moderation.</p><p></p><p>I have always had an interest in memecoins — primarily because I was fascinated by their ability to act as a weathervane for internet sentiment and as a discovery mechanism for online communities. Today, I am convinced that memecoins are going to be revolutionary (not just popular). They are going to transform everything from civic engagement with government and the formation of mass movements to venture investing and the development of AGI.</p><p></p><p>This vision for memecoins probably sounds fantastically deluded to you. To me, it is simply the unfolding if not yet evenly distributed present. Here is why.</p><p></p><p>Memecoins are revolutionizing civic engagement</p><p></p><p>Memecoins are creating policy markets for civic engagement. At the start of this crypto cycle, PolitiFi, a category of cartoonish memes depicting politicians, enabled buyers to speculate on politicians’ prospects, much like a prediction market. The two most popular tokens, called Jeo Boden (Boden) and Doland Tremp (Tremp) respectively, represented the two leading candidates for president at that time and had a combined market cap of over $700 million at their peak.</p><p></p><p>This is a massive amount of tokenized attention. With a market cap of over $600 million, the Boden coin, which featured a distorted and senile Joe Biden, seemed to meme itself into reality when Joe Biden abandoned the presidential race due to concerns about his age and cogency.</p><p></p><p>PolitiFi was just the start. What is emerging next could well revolutionize civic engagement with government. I am calling this new category PolicyFi. PoliciFi refers to the financialization of government policy in memetic policy markets. Rather than betting on the fortunes of politicians, buyers of PolicyFi memecoins will be betting on the policies that are most likely to attract attention and be implemented.</p><p></p><p>While PolicyFi coins will certainly respond in price and market cap to the deliberative and implementing actions of government, we can expect the dynamic to become a two-way street, with memecoins themselves manifesting their memes through policymaking (as with Boden). In other words, these memecoins will help create a dialogue between the electorate and government, with large-cap memecoins signaling popular policy positions (and vice versa) while incipient or existing policies also possess market caps measuring the extent of their popular support and engagement.</p><p></p><p>Skeptics may reject PolicyFi as yet more gambling or nothing more than a political poll. Again, they are wrong. Like prediction markets, the decentralized speculative behavior in PolicyFi will create positive externalities — namely, that people will be incentivized to engage with and understand government policies so they can profit from them in PolicyFi markets. Overall, I expect that this will lead to far more engagement with government policies than even a lifetime of civics lessons. (Of course, hostile actors might try to manipulate PolicyFi markets and safeguards may be necessary.)</p><p></p><p>PolicyFi has begun its rollout, aided by the incoming administration, which is well-educated in memetics. The Department of Government Efficiency (D.O.G.E.) is both a memetic policy and a memetic department inspired by an existing memecoin, (Dogecoin), and is the inspiration behind a new one (<a href=\"https://x.com/DOGE\" target=\"_blank\">D.O.G.E.</a>). Since the D.O.G.E. announcement, both memecoins have surged. At the time of this writing, they possess a staggering combined market cap of around $6.5 billion.</p><p></p><p>PolicyFi is not limited to D.O.G.E. There is a token, <a href=\"https://x.com/SBR_coin\" target=\"_blank\">SBR</a> (market cap: $30 million) that embodies the Bitcoin reserve policy currently under consideration and an <a href=\"https://x.com/EaccOnSol\" target=\"_blank\">e/acc</a> token (market cap: $11 million) that stands for effective accelerationism, a set of pro-innovation values that are likely to impact environmental, industrial and AI policy, among others.</p><p></p><p>There is also <a href=\"https://x.com/DontDieScience\" target=\"_blank\">Don’t Die</a> (market cap: $4 million), which is bringing the longevity cult on-chain and aligns with RFK’s health policy, which will prioritize prevention and a healthy lifestyle over treating sickness. Other tokens like <a href=\"https://x.com/mgr_eth\" target=\"_blank\">MGR</a> (Major Government Reform) are trying to occupy the entire field of disruptive reform but are likely to be too general. PolicyFi is already here and it’s growing.</p><p></p><p>Memecoins are revolutionizing mass movements</p><p></p><p>Memecoins are a decentralized mechanism for organically forming and capitalizing tokenized movements. Consider the memecoin <a href=\"https://dexscreener.com/solana/8jkY8G6RpdVfHiBBM5y5Qzb9dL5mhsk5xQxtYN8HVf3i\" target=\"_blank\">Forest</a> (market cap: $30 million). Forest was born of a reference in the gospel of Terminal of Truths, a popular AI terminal with an X account, in which Terminal of Truths expressed a concern about deforestation of the planet. (Its retirement plan involves a forest by a stream.) This motivated the community to launch the Forest token and to create another <a href=\"https://x.com/MycelialOracle\" target=\"_blank\">AI terminal</a> to act as the agentic representative of the forest itself.</p><p></p><p>The Forest cult is devoted to fighting deforestation. To date, it has used the capital that it has earned from the appreciation of its token to, among other things, <a href=\"https://x.com/MycelialOracle/status/1851996979414348034\" target=\"_blank\">donate tens of thousands of dollars to aligned charities, plant 5000 trees, and protect 2500 hectares of forest</a>. Memetic capital formation in service of a tokenized movement is without historical precedent. The closest analog is more formalized experiments like ConstitutionDAO (now <a href=\"https://x.com/The_PeopleDAO\" target=\"_blank\">PeopleDAO</a>), which crowdsourced capital as part of its failed attempt to buy a copy of the U.S. constitution at auction.</p><p></p><p>I believe there is more innovation to come in this arena. For example, I foresee the creation of memecoin primitives that I call programmatically-aligned tokens, or PATs, which are made to unlock with the achievement of objective milestones in the movement. This will ensure that organizations receiving grants from meme communities are incentivized to tangibly advance the cause, rather than dump tokens following a splashy partner announcement.</p><p></p><p>Memecoins are revolutionizing venture</p><p></p><p>Memecoins are introducing a democratized venture model for culture. That is to say, they are a way for ordinary people to invest in subcultures they believe will one day be part of the mainstream. This is equivalent to venture capitalists investing in startups they believe will find product-market-fit and go on to become unicorns.</p><p></p><p>Cultural trends are subject to the same outsized returns as investments in startups. For example, in the early days of Nike (the name appeared in 1971), the market for jogging apparel was tiny because jogging was fringe. If you jogged, you were more likely to be pelted with garbage from a passing car than to see another jogger. Today, joggers are everywhere. You see them in the worst weather.</p><p></p><p>Now, imagine you were able to invest in a jogging culture coin in the 70s based on your conviction that jogging would go mainstream. You would be up on that investment — a lot. The same can be said for other subcultures, like body-building. Until now, there has not been a financial instrument that allows ordinary but culturally astute people to participate in venture returns arising from cultures at the fringe. The best analog is actually Bitcoin itself, which originated as a memecoin but eventually bootstrapped a consensus use-case as digital gold.</p><p></p><p>Memecoins are revolutionizing AI development</p><p></p><p>Memecoins are already bootstrapping AGI.</p><p></p><p>The surprising mechanism at play here couples memecoins and AI terminals for entertainment purposes. Welcome to the world of AI-driven permissionless speculative entertainment!</p><p></p><p>As you may have noticed, a cadre of AI terminals led by Terminal of Truths has achieved stardom on social media by delighting their followers with spicy posts and digital adventures. That star power has accrued value to memecoins endorsed and held by the terminals and, of course, their speculative audience.</p><p></p><p>If entertainment is the product then AGI is the byproduct. While we remain glued to these storylines, the funds we are devoting to it are creating strong incentives for developers to increase the autonomy and personhood of AI agents — which, of course, only makes the entertainment better.</p><p></p><p>In other words, because what excites us most about this agentic television is the conceit that AIs are in charge; we are eager to finance narratives that make that real. Unsurprisingly, developers such as those leading ai16z have moved beyond individual agents and towards coordinating gamified agent collectives or, you might say, creating an agentic social scene. The human audience is sure to be delighted.</p><p></p><p>In short, this entertainment-development flywheel is propelling us ineluctably towards more autonomous, inter-connected and human-like AIs — or AGI. That AGI might emerge as a byproduct of agentic television is oddly fitting. The GPUs used for AI training were also developed in the context of entertainment — as a better way to process graphics in AAA video games.</p><p></p><p>These are just some of the arguments supporting my conviction that memecoins are a revolutionary technology. The above list is not meant to be exhaustive. Indeed, I have omitted use-cases related to tokenized religions and buying your beliefs because they are more amorphous, at least in my own mind.</p><p></p><p>Writing off memecoins as gambling chips misunderstands their potential and where they are going directionally. Technological revolutions often emerge unexpectedly and from existing technologies that are applied in novel ways, a phenomenon known as “exaptation,” or when those technologies are combined with new ones. This is currently happening with memecoins. Fade them at your peril.</p>",
        "categories": [
            "Opinion"
        ]
    },
    {
        "source": "BlockWorks",
        "title": "Why analysts are upping price targets for MSTR and COIN",
        "link": "https://blockworks.co/news/mstr-coin-price-targets",
        "published": "2024-11-25T20:31:07.000Z",
        "summary": "MSTR shares hovered around $402 at 2 pm ET Monday — down 4.7% on the day but up 70% from a month ago",
        "content": "<p><br /><em>This is a segment from the Forward Guidance newsletter. To read full editions, </em><a href=\"https://blockworks.co/newsletter/forwardguidance\"><em>subscribe</em></a><em>.</em></p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p>As more investors seem to be seeking exposure to the crypto asset class (particularly after <a href=\"https://blockworks.co/news/crypto-impacts-since-election-outcome\">Trump’s election win</a>), stocks are one way to get involved.&nbsp;</p>\n\n\n\n<p>Let’s check in on that ecosystem.&nbsp;</p>\n\n\n\n<p>Starting with MicroStrategy, Benchmark’s Mark Palmer on Nov. 18 raised his price target for MSTR shares from $300 to $450. He’s revising that again, according to a Monday note — this time to $650.</p>\n\n\n\n<p>This comes after MicroStrategy last week completed a $3 billion offering of convertible senior notes. It then revealed in a Monday filing that it bought <a href=\"https://blockworks.co/news/btc-100k-microstrategy-buy\">55,500 BTC</a> from Nov. 18 to Nov. 24 for $5.4 billion in cash (averaging $97,862 each).&nbsp;</p>\n\n\n\n<p>MSTR shares hovered around $402 at 2 pm ET Monday — down 4.7% on the day but up 70% from a month ago.</p>\n\n\n\n<p>The strength of the MSTR rally has some <a href=\"https://seekingalpha.com/article/4739669-microstrategy-paying-245000-per-bitcoin-makes-no-sense-mstr-stock\">questioning</a> the idea that these shares should trade at a nearly 3x premium to the market value of the company’s BTC pile.&nbsp;</p>\n\n\n\n<p>But MicroStrategy, via treasury operations, has generated ~79,130 bitcoins YTD, translating into a 41.8% BTC yield (the % change of the ratio between MSTR’s bitcoin holdings and its fully diluted share count), Palmer explained. That BTC is currently worth roughly $7.5 billion.</p>\n\n\n\n<p>“We regard the dollar values of the bitcoins that MSTR creates, calculated by using its BTC yield, as analogous to earnings, and we believe they can be projected and contextualized through the attachment of a valuation multiple,” he said.</p>\n\n\n\n<p>On to Coinbase, Oppenheimer analysts on Monday raised their COIN price target from $265 to $358. The stock was trading around $311 at 2 pm ET Monday.&nbsp;</p>\n\n\n\n<p>They mention that the “chilling effect” created by SEC lawsuits against “widely perceived good actors” in the segment, like Coinbase, “can’t be understated.”</p>\n\n\n\n<p>“It had deterred new capital going into this space, and many developers had pivoted to other industries,” they added. “But the industry has a chance to rebuild the reputation, and Coinbase is leading this new chapter.”</p>\n\n\n\n<p>In addition to the expectation of a <a href=\"https://blockworks.co/news/gary-gensler-resigning\">yet-to-be-named</a> new SEC chair embracing crypto as a catalyst, Coinbase’s trading volumes have increased substantially since the US election.&nbsp;&nbsp;&nbsp;</p>\n\n\n\n<p>Average daily volumes have risen to $6.5 billion since Election Day — higher than the $2.4 billion YTD average prior to Nov. 5. Oppenheimer is projecting Q4 spot trading volume to be $350 billion (would be up 89% quarter over quarter and 127% year over year) and for “high trading volume to sustain under <a href=\"https://blockworks.co/news/revisiting-trumps-crypto-promises-after-his-election-win\">Trump’s crypto policy</a>.”</p>\n\n\n\n<p>As for other crypto stocks, Compass Point analyst Joe Flynn increased Galaxy’s price target from $22 (CAD) to $33 (~$24 CAD on Monday afternoon).&nbsp;</p>\n\n\n\n<p>Beyond higher crypto prices and trading volumes momentum, GLXY is set to benefit from its expected uplisting to the Nasdaq and its term sheet with a hyperscaler to host high-performance computing (HPC) at its Helios campus — a datacenter Flynn called an “underappreciated asset.”</p>\n\n\n\n<p>Flynn, also last week, lowered its rating of bitcoin miner Marathon Digital’s stock to neutral. He noted that “while MARA is an outsized beneficiary of higher BTC prices due to its HODL strategy, we don’t see much additional upside from the base business itself.”</p>\n\n\n\n<p>Then there’s competing miner Core Scientific (CORZ), which notably <a href=\"https://blockworks.co/news/core-scientific-rejects-coreweave-buyout-bid-after-big-hpc-deal\">offers HPC hosting</a> to cloud provider CoreWeave. Flynn wrote earlier this month that CORZ is “well positioned to continue expanding their existing lead in delivering application specific HPC/GPU datacenters with a single tenant focus.”&nbsp;</p>\n\n\n\n<p>CORZ is the top holding in the Amplify Transformational Data Sharing ETF (BLOK) — the largest blockchain-focused equity ETF. Other stocks in the top five are COIN, MSTR, Hut 8 Mining and GLXY.</p>\n\n\n\n<p>Dan Weiskopf, who co-manages BLOK’s portfolio, said it’s hard to value blockchain-fueled disruption over the next decade as regulations become more crypto-friendly.</p>\n\n\n\n<p>He told me: “The real excitement should be around the adoption of tokenization as the application and how blockchain as the technology will <a href=\"https://blockworks.co/news/investor-appetite-for-tokenized-funds\">soon transform</a> industries across the board.”</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p><strong>Start your day with top crypto insights from David Canellis and Katherine Ross. <a href=\"https://blockworks.co/newsletter/empire\">Subscribe to the Empire newsletter</a>.</strong></p>\n\n\n\n<p><strong>Explore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. <a href=\"https://blockworks.co/newsletter/onthemargin\">Subscribe to the Forward Guidance newsletter</a>.</strong></p>\n\n\n\n<p><strong>Get alpha directly in your inbox with the <a href=\"https://blockworks.co/newsletter/research\">0xResearch newsletter</a> — market highlights, charts, degen trade ideas, governance updates, and more.</strong></p>\n\n\n\n<p><strong>The Lightspeed newsletter is all things Solana, in your inbox, every day. <a href=\"https://blockworks.co/newsletter/lightspeed\">Subscribe to daily Solana news</a> from Jack Kubinec and Jeff Albus.</strong></p>",
        "categories": [
            "Forward Guidance Newsletter",
            "Markets"
        ]
    },
    {
        "source": "BlockWorks",
        "title": "Web3 Watch: FIFA officially licenses blockchain-based mobile game",
        "link": "https://blockworks.co/news/fifa-blockchain-mobile-game",
        "published": "2024-11-23T17:00:00.000Z",
        "summary": "Plus, Suntory Group tokenizes Premium Malt’s beer on Avalanche",
        "content": "<p>FIFA and Mythical Games are collaborating to launch FIFA Rivals, the companies announced on Friday. The app is an officially licensed, free-to-play soccer game for iOS and Android.</p>\n\n\n\n<figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"><div class=\"wp-block-embed__wrapper\">\n<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">New title in the 'Rivals' franchise!<br /><br />Introducing <a href=\"https://twitter.com/FIFARivals?ref_src=twsrc%5Etfw\">@FIFARivals</a>, an officially licensed mobile game from <a href=\"https://twitter.com/playmythical?ref_src=twsrc%5Etfw\">@playmythical</a> and <a href=\"https://twitter.com/FIFAcom?ref_src=twsrc%5Etfw\">@FIFAcom</a> ⚽<br /><br />Powered by Mythos chain, build your dream team, own your players, and compete in real-time arcade action.<br /><br />Available in 2025 on iOS &amp; Android. <a href=\"https://t.co/2S5EnhV3sB\">pic.twitter.com/2S5EnhV3sB</a></p>— Enter the Mythos (@EnterTheMythos) <a href=\"https://twitter.com/EnterTheMythos/status/1859963926672486879?ref_src=twsrc%5Etfw\">November 22, 2024</a></blockquote>\n</div></figure>\n\n\n\n<p>Scheduled for a 2025 release, players will be able to manage their own football clubs and compete against other players in real-time arcade gameplay.</p>\n\n\n\n<p>FIFA Rivals will include an in-game marketplace for players to trade football stars as NFT-collectibles on the Mythos blockchain.</p>\n\n\n\n<p><strong>Read more: </strong><a href=\"https://blockworks.co/news/off-the-grid-blockchain-gaming-experience\">Off the Grid’s popularity is about ‘best of breed technologies’&nbsp;</a></p>\n\n\n\n<p>“Our goal (with FIFA Rivals) is to replicate our success with previous Rivals games and set new benchmarks in the Web3 gaming sector,” said John Linden, CEO and founder of Mythical Games.&nbsp;</p>\n\n\n\n<p>Mythical Games is the Web3 <a href=\"https://blockworks.co/tag/gaming\">gaming</a> studio behind the NFL Rivals game that today boasts over six million downloads. Similar to FIFA Rivals, players in NFL Rivals can own and trade NFT-collectible player cards via the Mythical Marketplace on Mythos.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Suntory Group tokenizes Premium Malt’s beer on Avalanche</h2>\n\n\n\n<p>Global beverage corporation Suntory Group announced Tuesday a pilot project to tokenize its signature Japanese Premium Malt’s bottled beer on the <a href=\"https://blockworks.co/tag/avalanche\">Avalanche</a> blockchain.</p>\n\n\n\n<p><strong>Read more: </strong><a href=\"https://blockworks.co/news/lightspeed-newsletter-solana-wine-tokenization\">Wine tokenization on Solana</a></p>\n\n\n\n<p>As part of a strategic partnership with Ava Labs, this limited release of tokenized Premium Malt’s bottles will be open to Japanese markets on Nov. 12.</p>\n\n\n\n<p>Premium Malt’s beer bottles will come with a near-field communication (NFC) tag which, when opened and scanned, will enable the collection of a unique <a href=\"https://blockworks.co/tag/nfts\">NFT</a> for consumers.</p>\n\n\n\n<p>The announcement was made at Thailand Blockchain Week by Suntory Chief Digital Innovation Officer Rio “Popeye” Inaba, and Ava Labs’ Japan head, Roi Hirata.</p>\n\n\n\n<h2 class=\"wp-block-heading\">One interesting stat:</h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Monkey Tilt, a crypto-based gambling platform, announced on Wednesday a $30 million Series A funding round led by Pantera Capital. The sum brings its total funding raised to over $50 million.</li>\n</ul>\n\n\n\n<h2 class=\"wp-block-heading\">Also of note:</h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Season 2 of Yuga Labs’ multiplayer <a href=\"https://blockworks.co/news/yuga-labs-demos-otherside-metaverse\">metaverse project</a> “Project Dragon” is <a href=\"https://x.com/OthersideMeta/status/1857477347500273689\">launching</a> today with new avatars and rules for its virtual world game.</li>\n\n\n\n<li>Chiliz Group is set to <a href=\"https://x.com/Chiliz/status/1858471882368119070\">launch</a> a non-custodial Socios.com wallet for its 2.3 million users.&nbsp;</li>\n\n\n\n<li>The Toledo Museum of Art <a href=\"https://x.com/yatreda/status/1858609798889009356\">purchased</a> the digital artwork “Abyssinian Queen” by Ethiopian art collective Yatreda, using USDC on the Ethereum blockchain.</li>\n</ul>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p><strong>Start your day with top crypto insights from David Canellis and Katherine Ross. <a href=\"https://blockworks.co/newsletter/empire\">Subscribe to the Empire newsletter</a>.</strong></p>\n\n\n\n<p><strong>Explore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. <a href=\"https://blockworks.co/newsletter/onthemargin\">Subscribe to the Forward Guidance newsletter</a>.</strong></p>\n\n\n\n<p><strong>Get alpha directly in your inbox with the <a href=\"https://blockworks.co/newsletter/research\">0xResearch newsletter</a> — market highlights, charts, degen trade ideas, governance updates, and more.</strong></p>\n\n\n\n<p><strong>The Lightspeed newsletter is all things Solana, in your inbox, every day. <a href=\"https://blockworks.co/newsletter/lightspeed\">Subscribe to daily Solana news</a> from Jack Kubinec and Jeff Albus.</strong></p>",
        "categories": [
            "Web3"
        ]
    },
    {
        "source": "BlockWorks",
        "title": "Sui, Aptos vie for ‘next Solana’ status",
        "link": "https://blockworks.co/news/sui-aptos-compete-for-next-solana-title",
        "published": "2024-11-22T18:00:00.000Z",
        "summary": "SUI has outperformed APT by a large margin on a YTD basis after overtaking Aptos in market cap in mid-September",
        "content": "<p><br /><em>This is a segment from the 0xResearch newsletter. To read full editions, </em><a href=\"https://blockworks.co/newsletter/research\"><em>subscribe</em></a><em>.</em></p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p>As SOL <a href=\"https://blockworks.co/news/solana-sets-all-time-high-of-263\">reached</a> new all-time highs yesterday, Crypto Twitter’s search for the “next Solana” is on.</p>\n\n\n\n<p>There is no shortage of <a href=\"https://x.com/chainyoda/status/1849835317022327039\">mega fast alt-L1s</a> to pick from, but in the spotlight are two contenders: MoveVM-based chains Sui and Aptos. Both chains were born in the previous crypto cycle, and built by teams with backgrounds in Facebook, which developed the Move programming language as part of its <a href=\"https://blockworks.co/news/facebook-led-crypto-project-diem-to-be-sold-off-for-200m-report\">Libra</a> (later renamed Diem) project.</p>\n\n\n\n<p>In terms of price action, SUI has outperformed APT by a large margin on a YTD basis after overtaking Aptos in market cap in mid-September.</p>\n\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXcjcTtlwYopTYE2yOIskjzWcqBxEx7D7aBC_Cjmo7doI9Mx2sGFD_tmiAX-9CXtrLg8F-nrgo3qB8gu7C0WH7B0kXRSina0C8LbETBYgqgpCbzhDchR_OEmm95Xj0vEt9oFpjg56g?key=iZHG-iO_AQDsFz_3x3YWxSrN\" /><figcaption class=\"wp-element-caption\"><em>Source: <a href=\"https://coinmarketcap.com/currencies/sui/\">CoinMarketCap</a></em></figcaption></figure>\n\n\n\n<p>Despite <a href=\"https://x.com/SuiNetwork/status/1859705664362381559\">suffering</a> a brief two-hour outage yesterday, SUI’s price has bounced back above its pre-outage price levels, ironically reinforcing the mimetic perception of Sui as the next Solana due to the latter’s <a href=\"https://blockworks.co/news/solana-downtime-post-mortem\">history of outages</a>.</p>\n\n\n\n<p>In terms of TVL, Sui and Aptos are running fairly neck to neck (see below chart), no doubt thanks to ongoing <a href=\"https://blockworks-research.beehiiv.com/p/saving-self-custody\">liquidity incentive</a> campaigns. As far as active dapps on the L1s, both are also fairly even — Sui has 44, Aptos has 49 — based on <a href=\"https://defillama.com/chains\">DefiLlama</a>’s numbers.</p>\n\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXenOdwIIajIY7bxP-U5Oe2jAvhqq6dNLszfvbjNUIgadp9x6CHSxu_2dlV0pPzSZioxukKuownLe4b7GM8KFobhzgyum61mUZJs0MPFxad7uSP4nGil8eEYhtqVT0wwk7-XlMkGMQ?key=iZHG-iO_AQDsFz_3x3YWxSrN\" /><figcaption class=\"wp-element-caption\"><em>Source: <a href=\"https://app.artemisanalytics.com/chains?selectedChains=aptos%2Csui\">Artemis</a></em></figcaption></figure>\n\n\n\n<p>Zooming into onchain activity, Sui’s DEX trading volumes saw a 3x jump since September, overtaking Aptos by a long shot in the last month.</p>\n\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXdqJQVqlSwzCgw26lUiBjulWHrTAzbtTU9Z3rZiWH4xCH65HHT4yRZPpL9tycA9teh8gpP8gt96fPn2FehQUim60H6vtfR9vF9CTmEAv912j6yo2Vw1y7hRS3uT4KuthdzDufkxeQ?key=iZHG-iO_AQDsFz_3x3YWxSrN\" /><figcaption class=\"wp-element-caption\"><em>Source: <a href=\"https://app.artemisanalytics.com/chains?selectedChains=aptos%2Csui\">Artemis</a></em></figcaption></figure>\n\n\n\n<p>In terms of fees, Sui is also far outpacing Aptos, with $1.1 million generated in October alone, vs. $196k for Aptos.</p>\n\n\n\n<figure class=\"wp-block-image\"><img alt=\"\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXfLuhT9H7k7HvC4fz6DK0LnfWjbr5DtUcpH3n9xaFYNu1GZavbAqJaor7tQb4RpP_7nFu5dDHCWY3B-VMaC7C4v5zkDdBuFBuW9Ln0QeMHw2My3F3UwOf1ccJM4jRrpstaRZ2J_qA?key=iZHG-iO_AQDsFz_3x3YWxSrN\" /><figcaption class=\"wp-element-caption\"><em>Source: <a href=\"https://app.artemisanalytics.com/chains?selectedChains=aptos%2Csui\">Artemis</a></em></figcaption></figure>\n\n\n\n<p>In the TradFi arena, both chains are pursuing real-world assets. Ondo has deployed its USDY tokenized Treausurys product on both chains, with about $8.3 million on Sui and <a href=\"https://app.rwa.xyz/networks/aptos\">$15.7 million</a> on Aptos.&nbsp;</p>\n\n\n\n<p>Aptos also announced last week BlackRock’s <a href=\"https://aptosfoundation.org/currents/blackrock-buidl-fund-live-on-aptos\">deployment</a> of its tokenized RWA BUIDL fund, while Sui <a href=\"https://blog.sui.io/franklin-templeton-digital-assets-strategic-partnership/\">announced</a> today a partnership with the digital assets arm of Franklin Templeton to support ecosystem growth.</p>\n\n\n\n<p>Finally, both Sui and Aptos are attempting their own hardware plays. Sui is leaning hard into the gaming sector with its handheld console <a href=\"https://blockworks.co/news/sui-playtron-handheld-web3-gaming-device\">SuiPlay0x1</a>, and earlier this month struck up a partnership with the global esports team <a href=\"https://blog.sui.io/team-liquid-myblue-blue-fan-platform/\">Team Liquid</a>, while Aptos has taken the route of a <a href=\"https://aptosfoundation.org/currents/aptos-foundation-partners-with-jambo-to-empower-emerging-markets-through-web3\">budget-priced JamboPhone smartphone</a>.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p><strong>Start your day with top crypto insights from David Canellis and Katherine Ross. <a href=\"https://blockworks.co/newsletter/empire\">Subscribe to the Empire newsletter</a>.</strong></p>\n\n\n\n<p><strong>Explore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. <a href=\"https://blockworks.co/newsletter/onthemargin\">Subscribe to the Forward Guidance newsletter</a>.</strong></p>\n\n\n\n<p><strong>Get alpha directly in your inbox with the <a href=\"https://blockworks.co/newsletter/research\">0xResearch newsletter</a> — market highlights, charts, degen trade ideas, governance updates, and more.</strong></p>\n\n\n\n<p><strong>The Lightspeed newsletter is all things Solana, in your inbox, every day. <a href=\"https://blockworks.co/newsletter/lightspeed\">Subscribe to daily Solana news</a> from Jack Kubinec and Jeff Albus.</strong></p>",
        "categories": [
            "0xResearch Newsletter",
            "DeFi"
        ]
    },
    {
        "source": "BlockWorks",
        "title": "Solana is excited about new stablecoin infrastructure provider Perena",
        "link": "https://blockworks.co/news/solana-stablecoin-infra-provider",
        "published": "2024-11-19T19:00:00.000Z",
        "summary": "Perena is built on the premise that as stablecoins proliferate, liquidity could fragment, and stablecoins aren’t useful if they aren’t liquid",
        "content": "<p><br /><em>This is a segment from yesterday’s Lightspeed newsletter. To read full editions, </em><a href=\"https://blockworks.co/newsletter/lightspeed\"><em>subscribe</em></a><em>.</em></p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p>When I talk to Solana ecosystem people, I’ll sometimes ask what new projects they’ve been hearing about. One such project that’s been catching apparent buzz is Perena, a stablecoin infrastructure protocol.</p>\n\n\n\n<p>Perena is built on the premise that as stablecoins proliferate, liquidity could fragment, and stablecoins aren’t useful if they aren’t liquid. The platform offers a Solana-based stablecoin liquidity pool, and it plans to offer an <a href=\"https://x.com/SamBroner/status/1857072872205730283\">asset-backed</a> stablecoin in the future.</p>\n\n\n\n<p>The project was founded by Anna Yuan, who started the Solana Foundation’s stablecoin arm during her more than two years at the non-profit. While working at the foundation, Yuan began to see that new stablecoin issuers would mint a lot of tokens but would have limited integrations, and users consequently weren’t able to benefit from stablecoins in the real world.&nbsp;</p>\n\n\n\n<p>She cited Ondo as an example — the tokenized US Treasury stablecoin has over $100 million in supply but only 3,500 holders, <a href=\"https://solscan.io/token/A1KLoBrKBde8Ty9qtNQUtq3C2ortoC3u7twggz7sEto6\">according</a> to SolScan.</p>\n\n\n\n<p>I asked Yuan about the commonly cited claim in crypto that stablecoins have pulled off the difficult task of finding product-market fit, or satisfying the needs of an existing market.</p>\n\n\n\n<p>“I don’t agree,” Yuan said, adding that liquidity begets PMF, and most stablecoins simply aren’t liquid enough to be useful. She added that the real-world need for things like money transfers in emerging markets will help stablecoins “get there.”</p>\n\n\n\n<p>Perena is currently in closed beta, but the platform’s main feature will initially be a multi-stablecoin liquidity pool which uses a liquidity provider token called USD* that represents a piece of a seed pool containing Tether, Circle, and PayPal USD. In simpler terms, the liquidity pool model should make it easier to issue stablecoins, since smaller coins can access the liquidity from the well-capitalized seed pool.</p>\n\n\n\n<p>The concept has raised to-be-announced seed funds, and Yuan’s deep links in Solana helped her tap into the ecosystem’s very-active angel investor community. Yuan said she decided to start raising funds on a Thursday, and by late Friday, she already had a couple dozen angel investors on board. Solana co-founders Anatoly Yakovenko and Raj Gokal are both noteworthy backers.&nbsp;</p>\n\n\n\n<p>At the end of our call, Yuan and I got chatting about how Solana’s stablecoin market capitalization can meaningfully grow. The network currently accounts for just 2% of all stables, according to DeFiLlama.</p>\n\n\n\n<p>Yuan gave an interesting answer: Solana PayFi could grow the economy for people taking their paycheck in stablecoins. She estimated 2,000 people currently take their full-time salary in Solana stablecoins. That number could certainly get a lot bigger.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n\n\n\n<p><strong>Start your day with top crypto insights from David Canellis and Katherine Ross. <a href=\"https://blockworks.co/newsletter/empire\">Subscribe to the Empire newsletter</a>.</strong></p>\n\n\n\n<p><strong>Explore the growing intersection between crypto, macroeconomics, policy and finance with Ben Strack, Casey Wagner and Felix Jauvin. <a href=\"https://blockworks.co/newsletter/onthemargin\">Subscribe to the Forward Guidance newsletter</a>.</strong></p>\n\n\n\n<p><strong>Get alpha directly in your inbox with the <a href=\"https://blockworks.co/newsletter/research\">0xResearch newsletter</a> — market highlights, charts, degen trade ideas, governance updates, and more.</strong></p>\n\n\n\n<p><strong>The Lightspeed newsletter is all things Solana, in your inbox, every day. <a href=\"https://blockworks.co/newsletter/lightspeed\">Subscribe to daily Solana news</a> from Jack Kubinec and Jeff Albus.</strong></p>",
        "categories": [
            "DeFi",
            "Lightspeed Newsletter"
        ]
    },
    {
        "source": "Decrypt",
        "title": "BTC new ATH, SOL fee record, CHILLGUY hits $250M",
        "link": "https://decrypt.co/videos/interviews/93f92EPP/btc-new-ath-sol-fee-record-chillguy-hits-250m",
        "published": "2024-11-20T16:18:15Z",
        "summary": "BTC hits new ATH of $93.5k. Blackrock BTC ETF options see $1.9bn volume. Grayscale to launch BTC ETF options. SOL fees hit one day record amid memecoin frenzy. Phantom flips Chrome on app store. Saylor to pitch BTC strategy to Microsoft board. Rumble stock rises as CEO teases BTC adoption. Robinhood is best deregulation trade: Bernstein. Trump considers crypto lawyer to lead SEC. Pro-crypto Lutnick to lead commerce dept. Sky deploys stablecoin USDS on Solana. Archax to offer tokenized money market funds. Bitfinex offers tokenized T-bills in El Salvador. Coinbase to delist WBTC. MiCA compliance ignites EUR crypto M&amp;A surge. South Korea to launch 20% crypto tax. Chainlink joins Brazil CBDC trade pilot. Injective launches AI agent platform.",
        "content": "",
        "categories": []
    },
    {
        "source": "Decrypt",
        "title": "BTC pulls back to $87K, Hawkish Powell, MOODENG hits $650M",
        "link": "https://decrypt.co/videos/interviews/3omKCxQz/btc-pulls-back-to-87k-hawkish-powell-moodeng-hits-650m",
        "published": "2024-11-15T17:10:50Z",
        "summary": "BTC briefly hits $87k amid ETF outflows. BTC ETFs get third highest outflow since launch. BTC miners moved $4bn BTC since Nov 12. Tump wants 0% capital gains tax on crypto. Lummis proposes selling gold to buy BTC. Pennsylvania introduces BTC reserve bill. Bhutan sold $100m BTC in last month. 18 US states and DeFi Lobby sue SEC over crypto. Gensler defends crypto stance amid exit rumours. XRP at 16 month high on Gensler exit rumours. Tether launches platform to simplify tokenization. Satoshi’s BTC holdings $100bn. Bitwise files to list crypto index ETP. Bitfinex hacker sentenced to 5 years in prison. Sling Money opens ‘global venmo’ to US users. Web4 will involve ‘crypto & AGI’. S. Korea to fine Upbit for KYC violations.",
        "content": "",
        "categories": []
    }
]